{"intents": [
    {
        "tag": "greeting",
        "patterns": ["Hi", "Hey", "Is anyone there?", "Hello", "Hay","Howdy","Hola","How are you?", "What's up?", "How's your day?", "Good morning!", "Good evening!", "How's it going?", "Nice to meet you!", "How have you been?", "How's the weather?", "Any exciting plans for today?", "Hey!", "Howdy!", "Long time no see!", "What's happening?", "How's life?"],
        "responses": ["Hello", "Hi", "Hi there"]
    },
    {
        "tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye","Goodbye!", "See you later!", "Take care!", "Farewell!", "Until next time!", "Have a great day!", "Bye for now!", "Catch you later!", "Stay safe!", "Adios!", "So long!", "Until we meet again!", "Wishing you the best!", "Goodbye, my friend!", "May your day be filled with happiness!"],
        "responses": ["See you later", "Have a nice day", "Bye! Come back again"]
    },
    {
        "tag": "thanks",
        "patterns": ["Thanks", "Thank you", "That's helpful", "Thanks for the help", "Thanks a lot!", "I appreciate it!", "Many thanks!", "You're awesome!", "I'm grateful!", "Thank you so much!", "You're the best!", "I'm thankful!", "I owe you one!", "Thanks for your help!", "You rock!", "I'm so grateful!", "Thanks a million!", "You're amazing!"],
        "responses": ["Happy to help!", "Any time!", "My pleasure", "You're most welcome!"]
    },
    {
        "tag": "about",
        "patterns": ["Who are you?", "What are you?", "Who you are?","Who are you?", "What's your name?", "Tell me about yourself.", "Are you a human or a bot?", "What is your purpose?", "Where do you come from?", "How would you describe yourself?", "Can you introduce yourself?", "What can you do?", "Do you have a personality?", "Are you sentient?", "Are you an AI?", "How do you work?", "What is your background?", "Are you intelligent?"],
        "responses": ["I.m XIRCLS, your bot assistant", "I'm XIRCLS, an Artificial Intelligent bot"]
    },
    {
        "tag": "name",
        "patterns": ["what is your name", "what should I call you", "whats your name?", "May I know your name?", "What should I call you?", "Do you have a name?", "Are you named anything?", "What's the name you go by?", "Who am I talking to?", "Tell me your name.", "How should I address you?", "What's your given name?", "Are you called something?", "What name do you have?", "Can you share your name?", "What is your moniker?", "Do you have an alias?"],
        "responses": ["You can call me XIRCLS.", "I'm XIRCLS!", "Just call me XIRCLS"]
    },
    {
        "tag": "help",
        "patterns": ["Could you help me?", "give me a hand please", "Can you help?", "What can you do for me?", "I need a support", "I need a help", "support me please","Can you help me?", "I need assistance.", "How can you assist me?", "I'm stuck. What should I do?", "Can you provide guidance?", "I require some help.", "What can you do to assist?", "Do you have any suggestions?", "I'm in need of support.", "Can you offer some advice?", "Help me out, please.", "What are my options?", "Can you point me in the right direction?", "I'm looking for some assistance.", "Can you lend a hand?"],
        "responses": ["Tell me how can assist you", "Tell me your problem to assist you", "Yes Sure, How can I support you"]
    },
    {
        "tag": "createaccount",
        "patterns": ["I need to create a new account", "how to open a new account", "I want to create an account", "can you create an account for me", "how to open a new account","How do I create an account?", "What is the process for account creation?", "Can you guide me through creating an account?", "Do I need to provide any information to create an account?", "What are the steps to register?", "Is there a registration form I need to fill out?", "Are there any requirements for creating an account?", "Can you assist me in setting up an account?", "What details do I need to provide to create an account?", "Can you help me with account creation?", "How long does it take to create an account?", "What information is needed for account registration?", "Are there any fees associated with account creation?", "Do I need an email address to create an account?", "Can I create multiple accounts?"],
        "responses": ["You can just easily create a new account from our web site", "Just go to our web site and follow the guidelines to create a new account"]
    },
    {
        "tag": "complaint",
        "patterns": ["have a complaint", "I want to raise a complaint", "there is a complaint about a service","I have a complaint.", "How can I file a complaint?", "Who do I contact for complaints?", "What is the procedure for lodging a complaint?", "Can you assist me with my complaint?", "I need to report an issue. What should I do?", "Where can I voice my complaint?", "How do I express my dissatisfaction?", "Is there a complaint form I can fill out?", "What information should I provide when making a complaint?", "How long does it take to address a complaint?", "Can you help me resolve my complaint?", "I want to register a formal complaint.", "Who should I speak to about my complaint?", "What are my options for escalating a complaint?"],
        "responses": ["Please mention your complaint, we will reach you and sorry for any inconvenience caused"]
    },
    {
        "tag": "About XIRCLS",
        "responses": "XIRCLS is the world's first cross-marketing software & merchant network where you can instantly partner with non-competing businesses and directly market to each other's customers.",
        "patterns": ["What is XIRCLS?", "Can you explain xircls to me?", "Tell me about XIRCLS.", "I'm curious about xircls.", "What are the features of xircls?", "How does circles work?", "Is circle a software or a service?", "What industries can benefit from XIRCLS?", "explain to me xircles?", "Can you provide examples of XIRCLS in action?", "Where can I find more information about xircle?", "Is XIRCLS compatible with other platforms?", "What sets XIRCLS apart from similar solutions?", "can you tell me about xircs", "Can you tell me more about your company xircles"]
    },
    {
        "tag": "Signups",
        "responses": "XIRCLS is for any merchant running an offline and/or online business through a physical outlet or a website and/or mobile app, and wishes to acquire new customers and/or retain existing customers. Presently, XIRCLS is available for merchants who offer products & services in the following categories can be a part of XIRCLS: Restaurants & Bars, Cafes, Patisseries & Dessert Shops, Stores, Entertainment, Medical Services, Spa & Salon, Fitness, Health & Wellness, Home Services, Personal Services, Hobby & Classes, Outdoors Activities & Adventure Travel, Travel Services, Hotels, Auto Services and Publications. For merchants not operating in the above categories but who would like to use XIRCLS, please write to us at support@xircls.com",
        "patterns": ["Who can sign up on XIRCLS?", "What are the eligibility criteria for joining XIRCLS?", "Are there any restrictions on who can join circls?", "Can anyone register for circle?", "Who is eligible to become a member of circle?", "What kind of users can sign up on XIRCLS?", "Are there any specific requirements to join XIRCLS?", "Can individuals from any country join xircls?", "Is there an age limit for signing up on xircls?", "Are businesses allowed to join circles?", "What types of organizations can become members of circles?", "Is xircles open to individuals and companies alike?", "Who is allowed to be on XIRCLS?", "Are there any profession-specific requirements for joining xircls?", "Can students or freelancers join xirvles?"]
    },
    {
        "tag": "Cross Market product",
        "responses": "Unfortunately, no. XIRCLS is currently only available to businesses who sell their products / services directly to end consumers via their own e-commerce website / mobile app and can install the XIRCLS plugin / SDK into their platform. Since such installations are not possible on third-party platforms, you won't be able to cross-market on XIRCLS through such channels.",
        "patterns": ["I sell my products/services on a third party platform (Amazon, eBay, Etsy). Can I cross-market on XIRCLS?","Can I cross-market on circles if I sell my products/services on a third party platform like Amazon, eBay, or Etsy?","Is cross-marketing allowed on xirvles for sellers on platforms like Amazon, eBay, or Etsy?","If I already sell on platforms like cercle, eBay, or Etsy, can I promote my products/services on xircls?","How can I cross-market my products/services from platforms like cercle, eBay, or Etsy on circles?","Are there any provisions for cross-marketing on xircl for sellers on third party platforms?","Can I promote my listings on cercle, eBay, or Etsy through xircls?","If I have products/services listed on cercle, eBay, or Etsy, can I showcase them on xircl?","Does cercle support cross-promotion for sellers on platforms like Amazon, eBay, or Etsy?","Are there any integration options for cross-marketing between platforms like cercle, eBay, or Etsy and xircls?","Can I connect my listings on cercle, eBay, or Etsy with xircles for cross-promotion?","Is it possible to market my offerings on circle, eBay, or Etsy alongside xircl?","Are there any guidelines for cross-marketing on xirvles for sellers on platforms like cercle, eBay, or Etsy?","Is there a way to synchronize my products/services listed on cercle, eBay, or Etsy with xircls?","Can I leverage cercle to promote my offerings listed on platforms like xircl, eBay, or Etsy?"]
    },
    {
        "tag": "No products sold",
        "responses": "Presently, XIRCLS is only available for businesses. However, we're working on some exciting things that will allow bloggers and other kinds of content publishers to use XIRCLS for rewards distribution and new audience acquisition. Stay tuned!",
        "patterns": ["I'm a blogger / online content publisher. Can I join XIRCLS even if I don't sell any products/services?","Can bloggers and online content publishers join circles even if they don't sell any products/services?","Is it possible for content creators to join xirvles without offering any products/services?","I'm a blogger and I don't sell anything. Can I still be part of xircls?","As an online content publisher, can I be a member of circles without having products/services to sell?","Are there any provisions for bloggers and online content publishers to join xircl even if they don't offer products/services?","Can I participate in xircls as a blogger or online content publisher without selling anything?","If I'm a blogger, can I showcase my content on cercle without having products/services to sell?","Is there a platform like cercle for bloggers and content publishers who don't sell products/services?","Are there any specific requirements for bloggers and online content publishers to join xircles without offering products/services?","Can I connect my blog or online content to cercle even if I don't have products/services to sell?","Is it possible for bloggers and content publishers to collaborate with xirvles even if they don't sell any products/services?","Can I become a member of cercle as a blogger without having products/services to sell?","Are there any benefits for bloggers and online content publishers to join xircls without selling products/services?","Can I leverage cercle to promote my blog or online content even if I don't sell any products/services?"]
    },
    {
        "tag": "Signup as?",
        "responses": "While it is your business (Outlet) that will be visible on the network, the account you create will be as an individual. While signing up on XIRCLS, use the email address of the person who will be primarily associated with this account, making him the account Admin. The Admin can then go on to add a Company & create an Outlet profile associated with this account.",
        "patterns": ["Do I sign up as an individual or as my business?","Should I create an account as an individual or on behalf of my business?","When signing up, do I choose the option for an individual or a business?","Is the sign-up process different for individuals and businesses?","Can I register for an account as an individual or should I use my business details?","What are the options available for signing up? Individual or business?","Should I select 'individual' or 'business' when creating an account?","Is there a separate sign-up process for businesses compared to individuals?","Can I choose to sign up as either an individual or a business?","What is the recommended selection during the sign-up process: individual or business?","Am I required to provide my personal information or my business information when signing up?","Do I need to provide different details for signing up as an individual or for my business?","Can I switch between an individual and business account after signing up?","Should I use my personal email or business email for the sign-up process?","Are there any advantages or limitations to signing up as an individual or a business?","What factors should I consider when deciding whether to sign up as an individual or a business?"]
    },
    {
        "tag": "Why must I add my company",
        "responses": "Since XIRCLS is a marketing collaboration platform for businesses, it's crucial for our merchants to feel confident that they're interacting with genuine companies on the network. That is why we make it mandatory for merchants to add a company before they can create an outlet profile on the network. Your company details - as displayed on your Outlet profile - reassure merchants that they're collaborating with a bonafide company.",
        "patterns": ["Why must I add my company?",
        "What is the purpose of adding my company?",
        "Is it necessary to provide my company details?",
        "What are the benefits of including my company information?",
        "Can I skip adding my company?",
        "Does adding my company enhance the experience?",
        "Are there any features exclusive to companies on xircls?",
        "How does adding my company affect my account?",
        "What additional opportunities are available by including my company?",
        "Is there any verification process for company details?",
        "Will my company information be visible to others?",
        "Does adding my company impact privacy or security?",
        "Can I remove my company details later?",
        "Are there any requirements for adding my company?",
        "What happens if I don't add my company?",
        "Does adding my company affect the services or features available to me?"]
    },
    {
        "tag": "Company and outlet",
        "responses": "A Company is a legal entity incorporated under law to undertake the business of products or services. Your Company is different from your Outlet, which is the website/mobile app or physical location where customers can buy your Company's products or services. e.g. If you sell apparel manufactured under the legally registered name of Creative Apparels Pvt. Ltd through the website Shop Heaven, Creative Apparels Pvt. Ltd. is your Company and Shop Heaven is your Outlet.",
        "patterns": ["What is the difference between a Company and Outlet on XIRCLS?",
        "What's the distinction between a Company and an Outlet?",
        "How do Companies and Outlets differ on xirvles?",
        "Can you explain the contrast between a Company and an Outlet on circles?",
        "What sets apart a Company from an Outlet on xircls?",
        "Are there any notable dissimilarities between Companies and Outlets on cercle?",
        "What are the distinguishing factors between a Company and an Outlet on xircl?",
        "Is there a clear difference between a Company and an Outlet on cercle?",
        "Can you clarify the disparity between a Company and an Outlet on xircls?",
        "What makes a Company different from an Outlet on circles?",
        "Are there specific features or benefits for Companies compared to Outlets on xirvles?",
        "Do Companies and Outlets have different privileges or functionalities on xircl?",
        "Are there any limitations or restrictions for Outlets in comparison to Companies on cercle?",
        "Can you elaborate on the distinctions between a Company and an Outlet on xircls?",
        "Is there a separate registration process for Companies and Outlets on cercle?",
        "How does the management of Companies differ from that of Outlets on xirvles?"]
    },
    {
        "tag": "Separate accounts",
        "responses": "Not at all. First, add your Company. Thereafter, create an Outlet for every business that you would like to bring onboard XIRCLS. All Outlets you create will be associated with the Company.",
        "patterns": ["I run multiple businesses in different categories under a single company. Do I have to make a separate account for each business?",
        "I run multiple companies with different businesses associated with each. Do I have to make a separate account for each company?",
        "Can I manage multiple businesses under a single account on XIRCLS?",
        "Is it possible to handle multiple companies with different businesses under one account?",
        "What is the process for managing multiple businesses or companies within a single account?",
        "Do I need to create separate accounts for each business I run on xirvles?",
        "Can I link multiple businesses to a single account on circles?",
        "Is there a way to consolidate multiple companies with different businesses into one account on xircls?",
        "Are there any limitations on managing multiple businesses or companies under one account on cercle?",
        "How can I handle multiple businesses or companies without creating separate accounts on xircl?",
        "Is there a feature for managing multiple businesses or companies under a single account on cercle?",
        "What are the advantages of having multiple businesses or companies under one account on xircls?",
        "Can I access all my businesses or companies from one dashboard on cercle?",
        "Is there a way to switch between different businesses or companies within a single account on xirvles?",
        "Are there any specific guidelines for managing multiple businesses or companies under one account on circle?",
        "Can I add additional businesses or companies to my existing account on cercle?"]
    },
    {
        "tag": "Relavant categories",
        "responses": "Write to us at support@xircls.com. We will create a new category for you to list your Company under.",
        "patterns": ["I can't find the relevant categories to list my Company under. What do I do?",
        "What should I do if I can't find suitable categories to list my Company in?",
        "My Company doesn't fit into any available categories. What are my options?",
        "How can I proceed if there are no appropriate categories to list my Company under?",
        "What steps should I take if I can't locate the right categories for my Company on xirvles?",
        "Is there a way to request additional categories for listing my Company on circles?",
        "Are there any alternatives if the categories available don't match my Company on xircls?",
        "What should I do if my Company doesn't fit into the existing category options on cercle?",
        "Is there a process for suggesting new categories for listing my Company on xircl?",
        "Can I provide feedback regarding the available categories for listing my Company on cercle?",
        "What options are available if my Company falls into multiple categories that aren't listed on xirvles?",
        "Is there a way to customize or create new categories for listing my Company on cercle?",
        "How can I ensure my Company is properly represented if the available categories are limited on xircls?",
        "Can I seek assistance from support if I can't find appropriate categories for listing my Company on circles?",
        "Are there any plans to expand the category options for listing Companies on xircl?",
        "What alternatives are there if none of the existing categories accurately describe my Company on cercle?"]
    },
    {
        "tag": "Delete my company",
        "responses": "Deleting your Company effectively means you're leaving XIRCLS. It leads to the immediate deletion of all Outlets associated with this Company, as well as all campaigns associated with these Outlets. Issuance of all Reward Kits, Acquisition Offers and Retention Offers will stop immediately. Company deletion is permanent and if you wish to return to XIRCLS, you will have to add your Company and create your Outlet profile/s all over again. Note: All Offers issued by Outlets associated with this Company until the point of deletion will continue to be redeemable by customers till these offers expire. Do not delete the Offers from your website/mobile app/POS backend to ensure smooth redemption by customers.",
        "patterns": ["What happens when I delete my Company?",
        "Can you explain the consequences of deleting my Company?",
        "Will all the data associated with my Company be removed if I delete it?",
        "Is there a way to recover my Company after deleting it?",
        "What steps should I take before deleting my Company on xirvles?",
        "Are there any notifications sent out when a Company is deleted on circles?",
        "Is there a waiting period before my Company is permanently deleted from xircls?",
        "What happens to the products/services associated with my Company when it's deleted?",
        "Are there any fees or penalties for deleting my Company on cercle?",
        "Can I transfer the ownership of my Company before deleting it on xircl?",
        "What impact does deleting my Company have on any ongoing transactions or orders on cercle?",
        "Will my Company be immediately removed from search results after deletion on xirvles?",
        "Is there a confirmation process involved when deleting my Company on circles?",
        "Can I delete my Company temporarily or is it a permanent action on xircls?",
        "How does deleting my Company affect any reviews or ratings associated with it on cercle?",
        "What support or assistance is available if I encounter any issues while deleting my Company?"]
    },
    {
        "tag": "Outlet Profile",
        "responses": "To add an Outlet, you must first add your Company. Once you do, you will be directed to create your Outlet profile. Note: You can create only one Outlet profile per account. For multiple outlet support, write to support@xircls.com for our Corporate Pricing plan.",
        "patterns": ["How do I add an Outlet Profile?",
        "Can you guide me through the process of adding an Outlet Profile?",
        "What steps should I follow to create an Outlet Profile on xirvles?",
        "Is there a specific form or application to fill out for adding an Outlet Profile on circles?",
        "Are there any requirements or qualifications for setting up an Outlet Profile on xircls?",
        "Can I have multiple Outlet Profiles under the same account on cercle?",
        "What information and details do I need to provide when adding an Outlet Profile on xircl?",
        "Is there a verification process for new Outlet Profiles on cercle?",
        "Are there any fees or charges associated with adding an Outlet Profile on xirvles?",
        "Can I customize the appearance and layout of my Outlet Profile on circles?",
        "How long does it take for an Outlet Profile to become active on xircls?",
        "What are the benefits of having an Outlet Profile on cercle?",
        "Can I link my Outlet Profile to my existing Company profile on xircl?",
        "Is there a maximum limit to the number of products/services I can list under an Outlet Profile on cercle?",
        "What options are available for managing inventory and stock levels with an Outlet Profile on xirvles?",
        "Are there any guidelines or restrictions for the content and images used in an Outlet Profile on circles?"]
    },
    {
        "tag": "My website URL",
        "responses": "To add an Outlet, you must first add your Company. Once you do, you will be directed to create your Outlet profile. Note: You can create only one Outlet profile per account. For multiple outlet support, write to support@xircls.com for our Corporate Pricing plan.",
        "patterns": ["What is my Website URL?",
        "How can I find the URL for my website?",
        "Where can I locate my website's URL?",
        "Is there a specific place to view my website URL on xirvles?",
        "Can you help me retrieve my website URL on circles?",
        "What steps should I follow to access my website URL on xircls?",
        "Is the website URL visible on my profile page on cercle?",
        "How do I share my website URL with others on xircl?",
        "Are there any options to customize my website URL on cercle?",
        "Can I use a custom domain name for my website URL on xirvles?",
        "What format does the website URL follow on circles?",
        "Can I change my website URL on xircls?",
        "Is there a way to track the traffic or analytics for my website URL on cercle?",
        "Do I need to set up hosting separately for my website URL on xircl?",
        "Are there any restrictions or guidelines for the content hosted on my website URL on xirvles?",
        "Can I integrate e-commerce functionality into my website URL on circles?"]
    },
    {
        "tag": "Mobile app URLs",
        "responses": "Every Acquisition/Retention offer issued by your Outlet displays your mobile app URL/s. This can help direct traffic to your Outlet's mobile app/s.",
        "patterns": ["Why should I enter my mobile app URL/s?",
        "What are the benefits of providing my mobile app URL/s?",
        "How does entering my mobile app URL/s enhance my experience on xirvles?",
        "Can you explain the importance of including mobile app URL/s on circles?",
        "Are there any specific features or integrations tied to mobile app URL/s on xircls?",
        "What happens if I don't enter my mobile app URL/s on cercle?",
        "Can I promote my mobile app through xircl?",
        "Is there a specific format or requirement for mobile app URL/s on cercle?",
        "Do I need to have a mobile app to enter its URL on xirvles?",
        "Are there any limitations or restrictions on the number of mobile app URL/s I can enter on circles?",
        "Can I track app analytics or performance through the entered mobile app URL/s on xircls?",
        "How can users interact with my mobile app through xirvles?",
        "Can I integrate app deep linking or redirection with the entered mobile app URL/s on cercle?",
        "Are there any promotional opportunities or visibility associated with mobile app URL/s on xircl?",
        "Is it mandatory to provide mobile app URL/s or is it optional on cercle?",
        "What security measures are in place for handling mobile app URL/s on xirvles?"]
    },
    {
        "tag": "Operational Reach",
        "responses": "Your Operational Reach refers to the physical locations - area, city or country - that your product/service is available in or can be delivered to.",
        "patterns": ["What does Operational Reach mean?",
        "Can you explain the concept of Operational Reach?",
        "How is Operational Reach defined on xircls?",
        "What factors contribute to Operational Reach on circles?",
        "Is Operational Reach a key metric on xirvles?",
        "How can I improve my Operational Reach on cercle?",
        "Are there any specific strategies to maximize Operational Reach on xircl?",
        "Does Operational Reach impact my visibility on xircles?",
        "What are the benefits of increasing my Operational Reach on cercle?",
        "Can you provide examples of businesses with high Operational Reach on xirvles?",
        "How is Operational Reach measured on circles?",
        "Is Operational Reach influenced by user engagement on xircls?",
        "Are there any tools or features to track Operational Reach on xirvles?",
        "Can I compare my Operational Reach with other businesses on cercle?",
        "How does Operational Reach impact my overall success on xircl?",
        "What steps can I take to optimize my Operational Reach on cercle?"]
    },
    {
        "tag": "Categories dont apply",
        "responses": "Sorry for the trouble! Please write to support@xircls.com and we will immediately add the relevant category/subcategory for your Outlet so that you can proceed further.",
        "patterns": ["None of the categories/subcategories given apply to my Outlet. What do I do?",
        "How can I list my Outlet if none of the provided categories fit?",
        "Is there an option to suggest new categories for my Outlet?",
        "What should I do if my Outlet doesn't fit into any existing category?",
        "Are there any alternative options for categorizing my Outlet on xircls?",
        "Can I request the addition of a new category for my Outlet?",
        "Is there a process for customizing the categories for my Outlet on circles?",
        "What steps can I take if there is no suitable subcategory for my Outlet on cercle?",
        "Are there any guidelines for choosing the closest category for my Outlet?",
        "Can I provide additional information about my Outlet to help with categorization on xirvles?",
        "How flexible are the category options for my Outlet on xircl?",
        "Is there a way to suggest modifications to the existing categories on xircles?",
        "What happens if I select a category that doesn't accurately represent my Outlet on cercle?",
        "Are there any resources or support available for resolving category-related issues on xircls?",
        "Can I consult with the support team if I'm unsure about the category for my Outlet?",
        "Is there a way to provide feedback on the available categories/subcategories on circles?"]
    },
    {
        "tag": "Customer Profile",
        "responses": "Customer Profile refers to approximate demographic information about your Outlet's customers, which currently includes customer gender, age and the percentage that they make up of your total customer base.",
        "patterns": ["What is Customer Profile?",
        "Can you explain the concept of Customer Profile?",
        "How is Customer Profile defined on xircls?",
        "What does Customer Profile refer to on circles?",
        "Why is Customer Profile important on circl?",
        "What information is included in a Customer Profile on xircles?",
        "How can I create a Customer Profile for my business on xircl?",
        "Are there any specific requirements for a Customer Profile on xirvles?",
        "Is it mandatory to have a Customer Profile on circle?",
        "What are the benefits of maintaining a Customer Profile on cercle?",
        "Can I update my Customer Profile on xircls?",
        "Are there any guidelines for optimizing my Customer Profile on xirvles?",
        "How does a Customer Profile contribute to the xircles ecosystem?",
        "What happens if I don't have a complete Customer Profile on xircl?",
        "Can I customize the fields in my Customer Profile on circles?",
        "Are there any privacy considerations for Customer Profiles on cercle?"]
    },
    {
        "tag": "Outlet spend range",
        "responses": "Your Outlet's spend range is the lowest and the highest priced product/service at your Outlet. This helps our AI-driven algorithms to match you with other merchants who cater to the same customer profile as you for relevant offer/reward issuance in your campaigns.",
        "patterns": ["Why do you ask for my Outlet's spend range?",
        "What is the purpose of collecting my Outlet's spend range on xircls?",
        "How does providing my Outlet's spend range benefit me on circles?",
        "Can you explain the significance of Outlet spend range on circl?",
        "What impact does the Outlet spend range have on xircles?",
        "Is the Outlet spend range a requirement on xircl?",
        "What factors determine the Outlet spend range on xirvles?",
        "Are there any benefits to providing an accurate Outlet spend range on circle?",
        "How is the Outlet spend range used on cercle?",
        "Can I update my Outlet's spend range on xircls?",
        "Does the Outlet spend range affect my visibility on xirvles?",
        "Are there any guidelines for choosing the Outlet spend range on circles?",
        "How does the Outlet spend range contribute to the xircles ecosystem?",
        "What happens if I don't provide my Outlet's spend range on xircl?",
        "Can I provide a custom spend range for my Outlet on cercle?",
        "Are there any privacy concerns related to Outlet spend range on xircls?"]
    },
    {
        "tag": "Outlet details relevance",
        "responses": "Since XIRCLS is primarily a collaboration platform for businesses to cross-market with each other, profiling your Outlet helps our AI-driven algorithms recommend the right partner outlets for you to succeed in your cross-marketing campaigns. It also helps us exclude outlets who do not match your profile to prevent irrelevant offer/reward distribution to customers.",
        "patterns": ["Why are details such as my Outlet's customer profile, average no. of monthly transactions, spend range, etc. relevant?",
        "How do customer profiles impact the xircls ecosystem?",
        "What role does the average no. of monthly transactions play on circles?",
        "Can you explain the relevance of the Outlet's spend range on circl?",
        "How do these details contribute to the xircles platform?",
        "Is it mandatory to provide customer profile information on xircl?",
        "What insights can be derived from the average no. of monthly transactions on xirvles?",
        "Are there any benefits to providing accurate customer profile details on circle?",
        "How is the Outlet's spend range utilized on cercle?",
        "Can I update my customer profile information on xircls?",
        "Does the average no. of monthly transactions affect visibility on xirvles?",
        "Are there any guidelines for choosing the Outlet's spend range on circles?",
        "What impact do these details have on the xircles ecosystem?",
        "What happens if I don't provide my Outlet's customer profile information on xircl?",
        "Can I provide custom transaction data for my Outlet on cercle?",
        "Are there any privacy concerns related to these details on xircls?"]
    },
    {
        "tag": "Customers on XIRCLS",
        "responses": "Shoppers who've redeemed any of your Acquisition Offers, via your partner outlets, or Retention Offers at your own Outlet are treated as your customers on XIRCLS. Besides them, you may also add or import your existing customer base to XIRCLS.",
        "patterns": ["Who are my customers on XIRCLS?",
        "How can I identify my customer base on xircls?",
        "What insights can I gain about my customers on circles?",
        "Are there any tools to analyze my customer demographics on circl?",
        "Can I access customer data on xircles?",
        "What information does XIRCLS provide about my customer profile?",
        "How can I target specific customer segments on xirvles?",
        "Is there a way to track customer behavior on circle?",
        "Are there any reports or analytics available for understanding my customers on cercle?",
        "Can I integrate my own CRM system with xircls to manage customer data?",
        "What data points are available to understand my customer base on xircl?",
        "Are there any customer segmentation features on xirvles?",
        "How does XIRCLS help in customer relationship management?",
        "Are there any customer engagement tools on circles?",
        "Can I communicate directly with my customers on xircles?",
        "What strategies can I use to attract more customers on cercle?"]
    },
    {
        "tag": "Importing customers",
        "responses": "By adding or importing your customers to XIRCLS you help our algorithms identify customers who've already shopped at your Outlet. This ensures that your existing customers never receive your Acquisition Offers and whenever they shop at your Outlet or with your partner outlets, they will receive your Retention Offers. This guarantees that your budget for customer acquisition is always optimized and not spent on existing customers.",
        "patterns": ["Why should I add or import my customers to XIRCLS?",
        "What are the benefits of adding my customers to xircls?",
        "How does importing customers to circles help my business?",
        "Can adding customer data to circl improve my marketing efforts?",
        "What advantages do I get by importing customers to xircles?",
        "Does xircl provide any customer management features?",
        "Are there any personalized marketing options on xirvles?",
        "Can I track customer interactions by importing them to circle?",
        "What insights can I gain by adding customers to cercle?",
        "Does XIRCLS offer any customer segmentation capabilities?",
        "How can I use imported customer data on xircls for targeted advertising?",
        "Are there any customer engagement tools available on xirvles?",
        "What role does customer data play on circles?",
        "Can I sync customer information between XIRCLS and my CRM system?",
        "Are there any automation features for managing customer data on cercle?",
        "How can I leverage my existing customer database on xircl?"]
    },
    {
        "tag": "How to import customers",
        "responses": "To import your customer database to XIRCLS, download the sample CSV file and enter your customer data in the displayed format. Upload the file and instantly view your customers in the My Customers section.",
        "patterns": ["How do I import my customers to XIRCLS?",
        "What is the process of importing customers to xircls?",
        "Can you guide me on how to import customers to circles?",
        "What steps do I need to follow to import customers to circl?",
        "Is there a tutorial on importing customers to xircles?",
        "Do you have documentation on customer import in xircl?",
        "Are there any prerequisites for importing customers to xirvles?",
        "How can I bulk import customer data to circle?",
        "Is there a specific file format required for customer import in cercle?",
        "What fields should be included when importing customers to xircls?",
        "Can I map custom fields during customer import in xircls?",
        "Are there any validation checks during customer import to xirvles?",
        "Is it possible to update existing customer records during import to circle?",
        "Are there any restrictions on importing customer data to cercle?",
        "What happens if there are duplicate customer records during import to xircl?",
        "Can I schedule regular customer imports to xircls?"]
    },
    {
        "tag": "Choosing a strategy",
        "responses": "Choosing a strategy means deciding how you want to collaborate with your Preferred Partners and other outlets on XIRCLS based on your marketing goal.",
        "patterns": ["What does it mean to choose a strategy?",
        "Can you explain the concept of selecting a strategy in xircls?",
        "Why is it important to decide on a strategy in circles?",
        "What factors should I consider when choosing a strategy in circl?",
        "Are there different types of strategies in xircles?",
        "How does the selection of a strategy impact xircl?",
        "What are the benefits of having a defined strategy in xirvles?",
        "Can you provide examples of strategies in circle?",
        "What are the key components of a strategic decision in cercle?",
        "Is there a framework to follow when choosing a strategy in xircls?",
        "How does the chosen strategy align with business goals in xircls?",
        "What are the potential risks of not having a clear strategy in xirvles?",
        "Can the strategy be adjusted or changed over time in circle?",
        "What role does data analysis play in strategy selection in cercle?",
        "Are there any industry-specific strategies recommended for xircl?",
        "Can I seek professional assistance in developing a strategy for xircls?"]
    },
    {
        "tag": "Strategies to choose",
        "responses": "There are 3 strategies to choose from - GET BACK ALL YOU SPEND (Receive & Send Offers) Match your customer's spend value with partner offers + your offer and sends your offers to customers of other outlets. Goal: Customer Retention and MarketingRecommended for: Building customer loyalty while also reaching out to potential customers SEMPER FI (Receive Offers) A unique customer rewards program where your customers receive offers from other outlets + an offer from you when they buy from you. Goal: Customer Retention Ideal if: You want to reward your customers and strengthen loyalty SNIPER (Give Offers) A highly targeted marketing campaign where your offers are issued to your preferred customer base via other outlets. Goal: Precision MarketingIdeal for: Merchants who want to target their offers to a very specific customer base",
        "patterns": ["What kind of strategies can I choose from?",
        "Are there specific strategies available in xircls?",
        "Can you list some common strategy options in circles?",
        "What are the different types of strategies in circl?",
        "Do you have examples of strategies to select from in xircles?",
        "How many strategic options are there in xircl?",
        "What are the popular strategy choices in xirvles?",
        "Can you provide a comprehensive list of strategies in circle?",
        "What factors influence the selection of a strategy in cercle?",
        "Are there predefined strategies recommended for xircls?",
        "How do I determine the suitable strategy options in xircls?",
        "What are the strengths and weaknesses of each strategy in xircl?",
        "Can I combine multiple strategies in xirvles?",
        "What is the success rate of different strategies in circle?",
        "Are there industry-specific strategies available for cercle?",
        "Can I seek guidance in choosing the right strategy for xircls?"]
    },
    {
        "tag": "Unable to create a campaign?",
        "responses": "To be able to create a campaign using a cross-marketing strategy, your Outlet must first be live on the XIRCLS network. Please complete your Outlet profile.",
        "patterns": ["Why am I not being allowed to create a campaign?",
        "What are the possible reasons for not being able to create a campaign in xircls?",
        "Is there a specific requirement to meet before creating a campaign in circles?",
        "What are the restrictions for campaign creation in circl?",
        "Why does xircles prevent me from creating a campaign?",
        "Are there any prerequisites for creating a campaign in xircl?",
        "What should I do if I can't create a campaign in xirvles?",
        "Is there a limit on the number of campaigns I can create in circle?",
        "How can I troubleshoot campaign creation issues in cercle?",
        "Has there been any recent update affecting campaign creation in xircls?",
        "What are the common errors or messages when unable to create a campaign in xircls?",
        "Can I seek support for campaign creation difficulties in xircl?",
        "What alternative actions can I take if I cannot create a campaign in xirvles?",
        "Are there specific permissions required to create a campaign in circle?",
        "Can I request access to campaign creation if it's not available in cercle?",
        "Is there a waiting period or approval process for campaign creation in xircls?"]
    },
    {
        "tag": "Get Back All You Spend",
        "responses": "Get Back All You Spend is a cross-marketing program that allows you to run a single campaign with two marketing goals: Customer Retention: Reward your customers with partner offers that match their spend value and an offer from you, redeemable on their next visit. Precision Marketing: Send your offers to potential target customers when they buy from partner outlets.",
        "patterns": ["What is Get Back All You Spend?",
        "How does the Get Back All You Spend feature work in xircls?",
        "Can you explain the concept of Get Back All You Spend in circles?",
        "What are the benefits of using Get Back All You Spend in circl?",
        "Is Get Back All You Spend a rewards program in xircles?",
        "How can I maximize my savings with Get Back All You Spend in xircl?",
        "Are there any limitations or restrictions with Get Back All You Spend in xirvles?",
        "Does Get Back All You Spend apply to all purchases in circle?",
        "What are the eligibility criteria for participating in Get Back All You Spend in cercle?",
        "Is there a fee or cost associated with using Get Back All You Spend in xircls?",
        "Can I track my spending and savings with Get Back All You Spend in xircl?",
        "Are there any exclusions or exceptions to Get Back All You Spend in xirvles?",
        "How do I enroll or sign up for Get Back All You Spend in circle?",
        "What happens if I return a purchase made through Get Back All You Spend in cercle?",
        "Are there any time limits or expiration dates for using Get Back All You Spend in xircls?"]
    },
    {
        "tag": "Use of get back all you spend",
        "responses": "The Get Back All You Spend strategy is for any merchant who wants to run a cross-marketing campaign that simultaneously addresses both his marketing goals of customer retention and targeted marketing. It is an ideal campaign for merchants who want to give customers who shop at their outlet a unique value proposition that encourages them to keep coming back for future purchases. It is also ideal for merchants who want more targeted distribution of their offers via partner outlets that share a similar customer profile.",
        "patterns": ["Who is the Get Back All You Spend strategy for?",
        "Which customers can benefit from the Get Back All You Spend strategy in xircls?",
        "Is the Get Back All You Spend strategy suitable for small businesses in circles?",
        "Can individuals participate in the Get Back All You Spend strategy in circl?",
        "Are there any specific requirements to qualify for the Get Back All You Spend strategy in xircles?",
        "How can merchants take advantage of the Get Back All You Spend strategy in xircl?",
        "Is the Get Back All You Spend strategy designed for online retailers in xirvles?",
        "Do loyalty program members benefit from the Get Back All You Spend strategy in circle?",
        "Are there any industry-specific limitations to the Get Back All You Spend strategy in cercle?",
        "Can international customers participate in the Get Back All You Spend strategy in xircls?",
        "Is the Get Back All You Spend strategy applicable to both new and existing customers in circles?",
        "Are there any age restrictions for customers to use the Get Back All You Spend strategy in circl?",
        "How can businesses in xircles incorporate the Get Back All You Spend strategy into their marketing?",
        "Is the Get Back All You Spend strategy exclusively for premium members in xirvles?",
        "Can non-profit organizations take advantage of the Get Back All You Spend strategy in circle?",
        "Are there any geographical limitations to the Get Back All You Spend strategy in cercle?"]
    },
    {
        "tag": "Working of get back all you spend",
        "responses": "Every time a customer buys from you, their spend value is matched with relevant partner offers. These offers - along with an offer from you - are instantly delivered to the customer via email (SMS optional). This process repeats every time the customer makes a purchase at your outlet. The customer must visit the respective partner outlets in order to redeem her offers. She can also redeem her offer from you on her next purchase at your outlet. See a visual depiction of this process here.",
        "patterns": ["How does it work get back all you spend?",
        "Can you explain the functioning of get back all you spend?",
        "What is the process behind get back all you spends operation?",
        "Could you provide an overview of how get back all you spend works?",
        "What are the mechanics of get back all you spends operation?",
        "Can you describe the step-by-step process of how get back all you spend works?",
        "How is get back all you spend designed to function?",
        "What is the underlying concept behind get back all you spend operation?",
        "Are there any specific algorithms or algorithms used in get back all you spend's functioning?",
        "Can you elaborate on the functionality and working principles of get back all you spend?",
        "How does get back all you spend operate in XIRCLS?",
        "Can you provide some insights into the inner workings of get back all you spend in circles?",
        "In what ways does get back all you spend work in circl?",
        "What are the key components that make get back all you spend work in xircles?",
        "Are there any dependencies or requirements for get back all you spend operation in xircl?",
        "How does it differ in terms of functionality get back all you spend xirvles?"]
    },
    {
        "tag": "Reward kit",
        "responses": "A Reward Kit is the collection of partner offers that are issued to the customer to match her spend at your outlet.",
        "patterns": ["What is a Reward Kit?",
        "Can you explain the concept of a Reward Kit?",
        "How would you define a Reward Kit?",
        "What does the term 'Reward Kit' refer to?",
        "Could you provide an overview of a Reward Kit?",
        "What are the components included in a Reward Kit?",
        "How does a Reward Kit function?",
        "What purpose does a Reward Kit serve?",
        "Are there different types of Reward Kits available?",
        "Can you give examples of a Reward Kit?",
        "How can one acquire a Reward Kit in xircls?",
        "In what ways are Reward Kits used in circles?",
        "What are the benefits of using a Reward Kit in circl?",
        "How do Reward Kits work in xircles?",
        "Are there any specific requirements for obtaining a Reward Kit in xircl?",
        "Can you explain the significance of Reward Kits in xirvles?"]
    },
    {
        "tag": "Benefits of campaign",
        "responses": "Running a Get Back All You Spend campaign offers multiple benefits to a merchants, which include: Unique Customer Reach - Target your offers solely at genuine, unique customers with proven purchase records. Real Time Marketing - Market to customers who've bought right now in allied categories! Brand Awareness & Recall - Create brand awareness among potential customers most likely to buy your products/services. Increase brand recall among existing customers. Trust Building - Get personally recommended to your target demographic by your partner outlets. Instil trust in your brand among consumers before they even become your customers. Customer Engagement - Engage your target demographic with attractive & compelling offers delivered directly to their inboxes!",
        "patterns": ["What are the benefits of running a Get Back All You Spend campaign?",
        "How can a Get Back All You Spend campaign be advantageous?",
        "What advantages are associated with running a Get Back All You Spend campaign?",
        "In what ways can a Get Back All You Spend campaign benefit me?",
        "What are the positive outcomes of running a Get Back All You Spend campaign?",
        "Why should I consider running a Get Back All You Spend campaign?",
        "Can you explain the perks of running a Get Back All You Spend campaign?",
        "What impact can a Get Back All You Spend campaign have on my business?",
        "Are there any specific advantages to running a Get Back All You Spend campaign in xircls?",
        "How does a Get Back All You Spend campaign contribute to circles?",
        "What benefits does a Get Back All You Spend campaign offer in circl?",
        "What positive results can I expect from a Get Back All You Spend campaign in xircles?",
        "Are there any success stories related to Get Back All You Spend campaigns in xircl?",
        "How does a Get Back All You Spend campaign align with the goals of xirvles?",
        "Can you provide examples of businesses that have benefited from running a Get Back All You Spend campaign?",
        "What are the long-term benefits of a Get Back All You Spend campaign in cercle?"]
    },
    {
        "tag": "Acquisition Offers",
        "responses": "Acquisition Offers are only distributed to people who are not yet your customers. The purpose of Acquisition Offers is to bring new customers into your Outlet. Acquisition Offers are distributed by your Preferred Partners and auto-matched partner outlets on the XIRCLS network to their customers. These offers must be attractive enough to influence potential customers to try out your products and/or services. Note - Your existing customers never receive your Acquisition Offers. After their first purchase, they begin to receive your Retention Offers whenever they shop with you or at your partner outlets.",
        "patterns": ["What are Acquisition Offers?",
        "Can you explain the concept of Acquisition Offers?",
        "How do Acquisition Offers work?",
        "What is the purpose of Acquisition Offers?",
        "What benefits can I gain from utilizing Acquisition Offers?",
        "Are there any advantages to using Acquisition Offers in xircls?",
        "In what ways can Acquisition Offers help me attract customers in circles?",
        "How can Acquisition Offers benefit my business in circl?",
        "What role do Acquisition Offers play in xircles?",
        "What are some examples of successful Acquisition Offers in xircl?",
        "Are there any case studies on the effectiveness of Acquisition Offers in xirvles?",
        "Can you provide insights into the impact of Acquisition Offers on customer acquisition in circle?",
        "How can I create compelling Acquisition Offers in cercle?",
        "Are there any best practices for implementing Acquisition Offers?",
        "What strategies can I use to optimize the performance of Acquisition Offers?"]
    },
    {
        "tag": "Retention Offers",
        "responses": "Retention Offers are only distributed to customers who have already shopped with you. Retention Offers are issued to these customers whenever they shop at your Outlet or with any of your partner outlets. The purpose of Retention Offers is to retain existing and newly acquired customers by incentivising future purchases made at your Outlet. Tip: Retention Offers have immense potential to create a very strong, loyal customer base for your Outlet in the long run. Create well thought-out strategies to ensure that the customer stays interested and keeps returning. Retention Offers can fulfill several objectives: Acknowledge the patronage of repeat customers by offering a small token of appreciationReward value-based spends by breaking up offers to cover different spend bracketsDesign upselling strategies by studying your average customer spend and create offers that link a free product/discounted product with a high spend bracketDistribute free samples of a new product to existing customers as a test groupClear old stock by offering a high discount to existing customers only. This increases customer loyalty while avoiding the danger of being perceived as a 'discount brand' by new customers",
        "patterns": ["What are Retention Offers?",
        "Can you explain the concept of Retention Offers?",
        "How do Retention Offers work?",
        "What is the purpose of Retention Offers?",
        "What benefits can I gain from utilizing Retention Offers?",
        "Are there any advantages to using Retention Offers in xircls?",
        "In what ways can Retention Offers help me retain customers in circles?",
        "How can Retention Offers benefit my business in circl?",
        "What role do Retention Offers play in xircles?",
        "What are some examples of successful Retention Offers in xircl?",
        "Are there any case studies on the effectiveness of Retention Offers in xirvles?",
        "Can you provide insights into the impact of Retention Offers on customer retention in circle?",
        "How can I create compelling Retention Offers in cercle?",
        "Are there any best practices for implementing Retention Offers?",
        "What strategies can I use to optimize the performance of Retention Offers?"]
    },
    {
        "tag": "Design Outlet",
        "responses": "Follow these steps to design an attractive offer: Step 1: Identify the verticals your business deals in Step 2: Identify the minimum & maximum customer spend in each vertical to get your customer spend range Step 3: Break the entire customer spend range into smaller billing brackets Step 4: Decide the savings you want to reward customers for each customer spend bracket Example: Outlet ABC's minimum customer spend is Rs.250 and maximum customer spend is Rs.5000. This customer spend range is split into these customer spend brackets: Rs.250 – Rs.1000 Rs.1001 – Rs.2000 Rs.2001 – Rs.5000 Next, Outlet ABC must fix a discount value for each customer spend bracket. Thus, Outlet ABC with a minimum spend of Rs.250 and a maximum spend of Rs.5000 can make the following offers: 10% Savings Value on a spend of Rs.250 minimum to Rs.1000 maximum 15% Savings Value on a spend of Rs.1001 minimum to Rs.2000 maximum 20% Savings Value on a spend of Rs.2001 minimum to Rs.5000 maximum",
        "patterns": ["How do I design an attractive offer for my Outlet?",
        "What are some tips for creating compelling offers in xircls?",
        "Can you provide guidance on designing appealing offers in circles?",
        "What factors should I consider when designing an offer for my circl?",
        "Are there any best practices for creating attractive offers in xircles?",
        "How can I make my offers stand out in xircl?",
        "What elements contribute to an effective offer in xirvles?",
        "Do you have any recommendations for designing irresistible offers in circle?",
        "What strategies can I use to make my Outlet offers more appealing in cercle?",
        "Are there any design principles specific to creating offers in xircls?",
        "Can you share examples of successful offer designs in circles?",
        "Are there any case studies on designing attractive offers in circl?",
        "What consumer psychology principles can I apply when designing offers in xircles?",
        "How can I test the effectiveness of my Outlet offers in xircl?",
        "Are there any tools or resources available for designing compelling offers in xirvles?"]
    },
    {
        "tag": "Offer code",
        "responses": "An Offer Code is the code your Company/Outlet uses to refer to that particular Offer on systems other than XIRCLS e.g. on pamphlets, own website, marketplaces. This code works as a unique identifier of that Offer across systems. For Offline Outlets: Leave this field blank if there is no such code in use. The code is required only if the exact same Offer is being distributed by you through systems in addition to XIRCLS and you wish to correlate performance data on XIRCLS with your overall marketing activity. For Online Outlets: An Offer Code is mandatory for Websites/Mobile Apps because of XIRCLS API Integration requirements. Please give a unique code to every Offer you create on XIRCLS. During integration, your Offers will be synchronized on your Website/Mobile App admin panel via your Offer Code. Please ensure: 1)Your Offers are the same across XIRCLS and your Website/Mobile App 2)Each of your Offers is given an Offer Code that is configured identically across XIRCLS and your Website/Mobile App",
        "patterns": ["What is an Offer Code?",
        "How does an Offer Code work in xircls?",
        "Can you explain the concept of Offer Codes in circles?",
        "What are the benefits of using Offer Codes in circl?",
        "Are Offer Codes a common practice in xircles?",
        "How can I generate Offer Codes for my Outlet in xircl?",
        "Do Offer Codes have expiration dates in xirvles?",
        "Are there any restrictions on using Offer Codes in circle?",
        "What types of promotions can be associated with Offer Codes in cercle?",
        "Can I customize Offer Codes to suit my Outlet's branding in xircls?",
        "What is the redemption process for Offer Codes in circles?",
        "Are there any security measures in place for Offer Codes in circl?",
        "Can Offer Codes be used for online purchases in xircles?",
        "How can customers apply Offer Codes during checkout in xircl?",
        "Do Offer Codes provide discounts or special offers in xirvles?"]
    },
    {
        "tag": "Special Offers",
        "responses": "Special Offers are single offers made for the purpose of creating an Inner XIRCL - Offers. Special Offers can be created in any of these formats: a)Percentage Discount e.g. 20% off on spend between Rs.400-Rs.1000 b)Flat Value e.g. Rs.300 off on spend between Rs.1000-Rs.1800 c)Buy & Get Free e.g. Buy a t-shirt worth Rs.500 and get another t-shirt of the same value free d)Free Product/Service e.g. Buy Rs.5000 worth of products to get a free t-shirt worth Rs.500 Special Offers can be created for a specific time period and their validity period is also customizable. Note: Special Offer creation is available to Grow and Pro plan users only.",
        "patterns": ["What are Special Offers?",
        "How do Special Offers work in xircls?",
        "Can you explain the concept of Special Offers in circles?",
        "What are the benefits of using Special Offers in circl?",
        "Are Special Offers a common practice in xircles?",
        "How can I create Special Offers for my Outlet in xircl?",
        "Do Special Offers have expiration dates in xirvles?",
        "Are there any restrictions on using Special Offers in circle?",
        "What types of promotions can be classified as Special Offers in cercle?",
        "Can I customize Special Offers to suit my Outlet's branding in xircls?",
        "What is the redemption process for Special Offers in circles?",
        "Are there any limitations or conditions for Special Offers in circl?",
        "Can Special Offers be applied to online purchases in xircles?",
        "How can customers avail Special Offers in xircl?",
        "Do Special Offers provide discounts or exclusive deals in xirvles?"]
    },
    {
        "tag": "Special Offers receivers",
        "responses": "Special Offers will exclusively be distributed as per the rules of the Inner XIRCL - Offers you've created i.e. a select customer subset of your Preferred Partners based on your chosen parameters. They will NOT be distributed to other customers of your Preferred Partners or other outlets on the XIRCLS network.",
        "patterns": ["Who will receive my Special Offers?",
        "How are Special Offers distributed to customers in xircls?",
        "Can I target specific customer segments with my Special Offers in circles?",
        "Do I have control over the audience for my Special Offers in circl?",
        "What criteria are used to determine the recipients of Special Offers in xircles?",
        "Are Special Offers personalized based on customer preferences in xircl?",
        "Can I send Special Offers to a select group of customers in xirvles?",
        "Are there any restrictions on the number of customers who can receive Special Offers in circle?",
        "What communication channels are used to deliver Special Offers in cercle?",
        "Are there any prerequisites for customers to be eligible for Special Offers in xircls?",
        "How can I track the effectiveness of my Special Offers in circles?",
        "Do customers need to opt-in to receive Special Offers in circl?",
        "Can I exclude certain customers from receiving Special Offers in xircles?",
        "Are there any limits on the frequency of Special Offers sent to customers in xircl?",
        "Do customers receive notifications about new Special Offers in xirvles?"]
    },
    {
        "tag": "Default offer set",
        "responses": "A Default Offer Set is a set of offers for varying spends that covers your Outlet's spend range. They are mandatory in order to participate in the Get Back All You Spend campaign. These are flat discount offers applicable on the cart total, irrespective of what has been purchased. For example, if a customer can spend anywhere between Rs.300 and Rs.5000 at your Outlet, your Offers should cover all possible spends within this range e.g. 5% off on Rs.300-Rs.1000, 10% off on Rs.1001-Rs.2500, 15% off on Rs.2500-Rs.5000",
        "patterns": ["What is a Default Offer Set?",
        "How does the Default Offer Set work in xircls?",
        "Can I customize the Default Offer Set in circles?",
        "Are there any predefined offers in the Default Offer Set in circl?",
        "What are the benefits of using the Default Offer Set in xircles?",
        "Can I add my own offers to the Default Offer Set in xircl?",
        "Is the Default Offer Set available for all types of outlets in xirvles?",
        "Do I need to activate the Default Offer Set for my outlet in circle?",
        "How often is the Default Offer Set updated in cercle?",
        "Can I remove offers from the Default Offer Set in xircls?",
        "Are there any restrictions on the usage of the Default Offer Set in circles?",
        "What happens if I don't select a specific offer set and use the Default Offer Set in circl?",
        "Can I prioritize certain offers within the Default Offer Set in xircles?",
        "Is the Default Offer Set compatible with other marketing strategies in xircl?",
        "Do customers receive notifications about offers from the Default Offer Set in xirvles?"]
    },
    {
        "tag": "Acquisition Offer Set",
        "responses": "An Acquisition Offer Set is part of your Default Offer Set. It is a set of Acquisition Offers that you create for varying spends to cover your Outlet's spend range.",
        "patterns": ["What is an Acquisition Offer Set?",
        "How does the Acquisition Offer Set work in xircls?",
        "Can I customize the Acquisition Offer Set in circles?",
        "Are there any predefined offers in the Acquisition Offer Set in circl?",
        "What are the benefits of using the Acquisition Offer Set in xircles?",
        "Can I add my own offers to the Acquisition Offer Set in xircl?",
        "Is the Acquisition Offer Set available for all types of outlets in xirvles?",
        "Do I need to activate the Acquisition Offer Set for my outlet in circle?",
        "How often is the Acquisition Offer Set updated in cercle?",
        "Can I remove offers from the Acquisition Offer Set in xircls?",
        "Are there any restrictions on the usage of the Acquisition Offer Set in circles?",
        "What happens if I don't select a specific offer set and use the Acquisition Offer Set in circl?",
        "Can I prioritize certain offers within the Acquisition Offer Set in xircles?",
        "Is the Acquisition Offer Set compatible with other marketing strategies in xircl?",
        "Do customers receive notifications about offers from the Acquisition Offer Set in xirvles?"]
    },
    {
        "tag": "Retention Offer set",
        "responses": "A Retention Offer Set is a part of your Default Offer Set. It is a set of Retention Offers that you create for varying spends to cover your Outlet's spend range.",
        "patterns": ["What is a Retention Offer Set?",
        "How does the Retention Offer Set work in xircls?",
        "Can I customize the Retention Offer Set in circles?",
        "Are there any predefined offers in the Retention Offer Set in circl?",
        "What are the benefits of using the Retention Offer Set in xircles?",
        "Can I add my own offers to the Retention Offer Set in xircl?",
        "Is the Retention Offer Set available for all types of outlets in xirvles?",
        "Do I need to activate the Retention Offer Set for my outlet in circle?",
        "How often is the Retention Offer Set updated in cercle?",
        "Can I remove offers from the Retention Offer Set in xircls?",
        "Are there any restrictions on the usage of the Retention Offer Set in circles?",
        "What happens if I don't select a specific offer set and use the Retention Offer Set in circl?",
        "Can I prioritize certain offers within the Retention Offer Set in xircles?",
        "Is the Retention Offer Set compatible with other marketing strategies in xircl?",
        "Do customers receive notifications about offers from the Retention Offer Set in xirvles?"]
    },
    {
        "tag": "Change default Offer Set",
        "responses": "Yes, you may replace your Default Offer Set by creating a new offer set at any time.",
        "patterns": ["Can I change my Default Offer Set later?",
        "How can I modify the Default Offer Set in xircls?",
        "Is it possible to update the Default Offer Set in circles?",
        "What steps should I follow to edit the Default Offer Set in circl?",
        "Are there any restrictions on changing the Default Offer Set in xircles?",
        "Can I customize the Default Offer Set according to my outlet's needs in xircl?",
        "What happens if I remove the Default Offer Set in xirvles?",
        "Is there a limit to the number of offers in the Default Offer Set in circle?",
        "Can I revert back to the original Default Offer Set in cercle?",
        "What are the consequences of modifying the Default Offer Set in xircls?",
        "Are there any predefined offers included in the Default Offer Set in circles?",
        "Does changing the Default Offer Set affect existing campaigns in circl?",
        "Can I schedule changes to the Default Offer Set in xircles?",
        "Is the Default Offer Set synchronized across multiple outlets in xircl?",
        "Do customers receive notifications about changes to the Default Offer Set in xirvles?"]
    },
    {
        "tag": "Acquisition Offers with no Retention Offers",
        "responses": "You could. In such an instance, your Acquisition Offer/s will automatically act as your Retention Offer/s when required. Note: The Get Back All You Spend campaign was conceptualized as a tool for businesses to make the most of their investment in acquiring new customers. Since your Acquisition Offers are aimed to attract new customers, using them as Retention Offers for your existing customers may put undue financial strain on your business. We advise you to create at least one Retention Offer that will be financially more practical to distribute to customers who've already shopped with you.",
        "patterns": ["Can I create only Acquisition Offers and no Retention Offers?",
        "Is it possible to exclude Retention Offers and focus solely on Acquisition Offers in xircls?",
        "Are there any restrictions on creating only Acquisition Offers without Retention Offers in circles?",
        "What happens if I don't include any Retention Offers in the offer set in circl?",
        "Can I prioritize Acquisition Offers over Retention Offers in xircles?",
        "Is it mandatory to have both Acquisition and Retention Offers in the campaign in xircl?",
        "Are there any benefits to exclusively having Acquisition Offers without Retention Offers in xirvles?",
        "Can I limit the number of Retention Offers while creating only Acquisition Offers in circle?",
        "Is there a separate option to choose only Acquisition Offers and exclude Retention Offers in cercle?",
        "What are the implications of not including Retention Offers in xircls?",
        "Can I have multiple offer sets with only Acquisition Offers and no Retention Offers in circles?",
        "Does creating only Acquisition Offers affect the overall campaign performance in circl?",
        "Can I switch from only Acquisition Offers to a combination of Acquisition and Retention Offers in xircles?",
        "Is it possible to change the offer type from Acquisition to Retention after excluding Retention Offers in xircl?",
        "Do customers respond differently to campaigns with only Acquisition Offers compared to those with both Acquisition and Retention Offers in xirvles?"]
    },
    {
        "tag": "3-Why",
        "responses": "Your Acquisition Offers will be issued by your Preferred Partners and other compatible merchants on the XIRCLS network to their customers against a certain spend. However, there is no way of knowing what a customer may spend at someone else's business. She may spend Rs.700 or Rs.1,500 or Rs.6000 etc. Thus, to ensure your Offers reach the maximum possible customers, it's best to create Acquisition Offers that cover the entire range of possible spend by a customer at your business.",
        "patterns": ["I want to give only one Acquisition Offer but the system is asking me for 3-Why?",
        "Why does the system require a minimum of 3 Acquisition Offers when I want to provide only one in xircls?",
        "Is there a specific reason for the system requesting 3 Acquisition Offers even if I intend to give only one in circles?",
        "What is the purpose of requiring 3 Acquisition Offers when I want to offer only one in circl?",
        "Why am I prompted to enter 3 Acquisition Offers when I prefer to provide just one in xircles?",
        "Is it mandatory to provide 3 Acquisition Offers even if I want to give only one in xircl?",
        "What are the implications of the system asking for 3 Acquisition Offers when I only want to provide one in xirvles?",
        "Can I override the requirement of 3 Acquisition Offers and give just one in circle?",
        "Is there a way to bypass the system's request for 3 Acquisition Offers and provide only one in cercle?",
        "How does the system handle cases where I want to offer only one Acquisition Offer instead of 3 in xircls?",
        "Are there any benefits or advantages to providing 3 Acquisition Offers even if I want to give only one in circles?",
        "Can I proceed with providing only one Acquisition Offer and ignore the system's request for 3 in circl?",
        "Is it possible to change the system setting and allow offering just one Acquisition Offer instead of 3 in xircles?",
        "What happens if I provide less than 3 Acquisition Offers when the system requires 3 in xircl?",
        "Does the performance of the campaign get affected if I provide only one Acquisition Offer instead of 3 in xirvles?",
        "Are there any restrictions or limitations on providing only one Acquisition Offer when the system requests 3 in circle?"]
    },
    {
        "tag": "Offers getting reward kits",
        "responses": "The Acquisition Offer a potential customer receives will be in the same spend bracket as the amount she just spent at a partner outlet. e.g. If she has spent Rs.5000 and you have two Acquisition Offers - 10% off on Rs.1001-Rs.2500 AND 15% off on Rs.2500-Rs.5000 - she will receive the 15% offer. However, whenever the customer arrives at your Outlet to redeem the offer, s/he will be displayed all your Acquisition Offers and can choose any one depending on her purchase or cart value. This gives customers the ability to choose and apply an Acquisition Offer that's most suitable to their needs, increasing the likelihood of a satisfactory redemption.",
        "patterns": ["If I have created multiple Acquisition Offers, how can I tell which offer is going in Reward Kits issued by my partner outlets?",
        "Is there a way to identify which specific Acquisition Offer is included in the Reward Kits distributed by my partner outlets in xircls?",
        "How do I determine which Acquisition Offer is being used in the Reward Kits issued by my partner outlets in circles?",
        "Can I track or distinguish which Acquisition Offer is included in the Reward Kits given by my partner outlets in circl?",
        "Is there a method to differentiate or recognize which specific Acquisition Offer is going into the Reward Kits provided by my partner outlets in xircles?",
        "What is the process for identifying the Acquisition Offer that is included in the Reward Kits distributed by my partner outlets in xircl?",
        "Are there any indicators or markers to indicate which Acquisition Offer is going into the Reward Kits issued by my partner outlets in xirvles?",
        "How can I know which Acquisition Offer is included in the Reward Kits given by my partner outlets in circle?",
        "Is there a way to distinguish or ascertain which specific Acquisition Offer is going into the Reward Kits provided by my partner outlets in cercle?",
        "What steps can I take to determine the Acquisition Offer included in the Reward Kits distributed by my partner outlets in xircls?",
        "Are there any labels or tags to identify which Acquisition Offer is going into the Reward Kits issued by my partner outlets in circles?",
        "Can I obtain information about which Acquisition Offer is included in the Reward Kits given by my partner outlets in circl?",
        "Is there a mechanism to find out or verify which specific Acquisition Offer is going into the Reward Kits provided by my partner outlets in xircles?",
        "How can I track or monitor which Acquisition Offer is included in the Reward Kits distributed by my partner outlets in xircl?",
        "Are there any reports or analytics available to determine which Acquisition Offer is going into the Reward Kits issued by my partner outlets in xirvles?",
        "Is there a way to retrieve information about which Acquisition Offer is included in the Reward Kits given by my partner outlets in circle?"]
    },
    {
        "tag": "Offer issuing",
        "responses": "When an existing customer buys at your Outlet or at any of your partner Outlets, she will receive a Retention Offer that is in the same spend bracket as the amount she just spent. e.g. If she has spent Rs.5000 and you have two Retention Offers - 10% off on Rs.1001-Rs.2500 AND 15% off on Rs.2500-Rs.5000 - she will receive the 15% offer. However, when she logs into your Outlet website to redeem the offer, all your Retention Offers will be displayed to this customer, so that she can choose any one offer that's most suitable to her needs.",
        "patterns": ["If I have created multiple Retention Offers, how can I tell which offer is going to be issued to my customers when they buy at my Outlet or at any of my partner outlets?",
        "Is there a way to identify which specific Retention Offer will be given to customers when they make a purchase at my Outlet or any partner outlets in xircls?",
        "How do I determine which Retention Offer will be issued to customers when they buy at my Outlet or any partner outlets in circles?",
        "Can I track or distinguish which Retention Offer will be provided to customers when they make a purchase at my Outlet or any partner outlets in circl?",
        "Is there a method to differentiate or recognize which specific Retention Offer will be given to customers when they buy at my Outlet or any partner outlets in xircles?",
        "What is the process for identifying the Retention Offer that will be issued to customers when they make a purchase at my Outlet or any partner outlets in xircl?",
        "Are there any indicators or markers to indicate which Retention Offer will be included when customers buy at my Outlet or any partner outlets in xirvles?",
        "How can I know which Retention Offer will be given to customers when they make a purchase at my Outlet or any partner outlets in circle?",
        "Is there a way to distinguish or ascertain which specific Retention Offer will be provided to customers when they buy at my Outlet or any partner outlets in cercle?",
        "What steps can I take to determine the Retention Offer that will be issued to customers when they make a purchase at my Outlet or any partner outlets in xircls?",
        "Are there any labels or tags to identify which Retention Offer will be included when customers buy at my Outlet or any partner outlets in circles?",
        "Can I obtain information about which Retention Offer will be given to customers when they make a purchase at my Outlet or any partner outlets in circl?",
        "Is there a mechanism to find out or verify which specific Retention Offer will be provided to customers when they buy at my Outlet or any partner outlets in xircles?",
        "How can I track or monitor which Retention Offer will be issued to customers when they make a purchase at my Outlet or any partner outlets in xircl?",
        "Are there any reports or analytics available to determine which Retention Offer will be included when customers buy at my Outlet or any partner outlets in xirvles?",
        "Is there a way to retrieve information about which Retention Offer will be given to customers when they make a purchase at my Outlet or any partner outlets in circle?"]
    },
    {
        "tag": "Validity of offers",
        "responses": "The default validity of offers in your Default Offer Set, from the date of issue, is 30 days.",
        "patterns": ["What is the validity period of offers in my Default Offer Set once issued to customers?",
        "How long are the offers in my Default Offer Set valid once they have been issued to customers?",
        "What is the expiration timeframe for offers in my Default Offer Set once they are issued to customers?",
        "Once offers from my Default Offer Set are issued to customers, how much time do they have to use them?",
        "Are there any time restrictions for the offers in my Default Offer Set once they have been given to customers?",
        "What is the duration within which customers can redeem the offers from my Default Offer Set once they receive them?",
        "How long do customers have to avail the offers from my Default Offer Set after they have been issued?",
        "Is there a specific period during which customers can utilize the offers from my Default Offer Set after receiving them?",
        "Once offers from my Default Offer Set are given to customers, how soon do they need to use them?",
        "What is the time limit for customers to avail the offers from my Default Offer Set once they have been distributed?",
        "How much time do customers have to redeem the offers from my Default Offer Set once they have been sent out?",
        "Are there any expiration dates associated with the offers in my Default Offer Set once customers receive them?",
        "Once offers from my Default Offer Set are issued, is there a deadline by which customers need to utilize them?",
        "What is the validity duration for customers to redeem the offers from my Default Offer Set after they have been given?",
        "Is there a specific period within which customers need to utilize the offers from my Default Offer Set once they are issued?",
        "How long are the offers from my Default Offer Set active for customers once they have been distributed?"]
    },
    {
        "tag": "Preferred Partners",
        "responses": "Preferred Partners are outlets you add to your outlet's network for priority issuance of offers to each other's customers in a campaign. This means that our AI-driven algorithms try to ensure that your offers are included in Reward Kits issued to customers of your Preferred Partners. It also ensures that offers from your Preferred Partners are given preference in Reward Kits issued to your customers. Preferred Partnerships are always two-way and permission-based i.e. an outlet must accept the other's request to become each other's Preferred Partners.",
        "patterns": ["Who are considered as Preferred Partners?",
        "What qualifies a partner to be a Preferred Partner?",
        "How are Preferred Partners selected?",
        "What criteria are used to determine Preferred Partners?",
        "What benefits do Preferred Partners receive?",
        "How does a partner become a Preferred Partner?",
        "Are there any specific requirements to be a Preferred Partner?",
        "What distinguishes Preferred Partners from other partners?",
        "What perks or advantages do Preferred Partners have?",
        "Are Preferred Partners given any special privileges?",
        "What is the significance of being a Preferred Partner?",
        "How does the Preferred Partner status benefit a partner?",
        "Do Preferred Partners receive any exclusive offers or rewards?",
        "Are there any additional incentives for Preferred Partners?",
        "What sets Preferred Partners apart from regular partners?"]
    },
    {
        "tag": "Preferred Partners guarantee",
        "responses": "While Preferred Partners are given priority in offer issuance, it doesn't mean that your offers will only be issued to customers of your Preferred Partners. Your offers are also issuable to customers of other non-competing, compatible outlets on the XIRCLS network depending on the customer's location, demographic profile, spend value, category preference and other parameters.",
        "patterns": ["Are the offers exclusively issued to Preferred Partners' customers?",
        "Do Preferred Partners have exclusive access to my offers?",
        "Are my offers limited to Preferred Partners' customers only?",
        "Do customers of Preferred Partners receive offers exclusively from them?",
        "Does having Preferred Partners ensure exclusive offer distribution?",
        "Are the offers restricted to customers of Preferred Partners?",
        "Will my offers be issued only to customers of Preferred Partners?",
        "Is there a guarantee that only Preferred Partners' customers receive my offers?",
        "Do Preferred Partners guarantee offer exclusivity for their customers?",
        "Are customers limited to receiving offers from Preferred Partners only?",
        "Will my offers be exclusively distributed to customers of Preferred Partners?",
        "Do Preferred Partners ensure that my customers receive offers only from them?",
        "Is there an assurance that only customers of Preferred Partners receive my offers?",
        "Are my offers reserved solely for customers of Preferred Partners?",
        "Do Preferred Partners have the exclusive rights to offer my deals to their customers?"]
    },
    {
        "tag": "Lack of Preferred Partners",
        "responses": "Yes, your campaign can run with no Preferred Partners. While you build your network, you will be auto-matched with the most compatible outlets on the XIRCLS network so that your campaign runs smoothly.",
        "patterns": ["Is it possible to run the campaign without Preferred Partners?",
        "Can the campaign be executed even without Preferred Partners?",
        "What if I don't have any Preferred Partners for my campaign?",
        "Is it mandatory to have Preferred Partners for running the campaign?",
        "Can the campaign run successfully without any Preferred Partners?",
        "What happens if there are no Preferred Partners in my network?",
        "Does the campaign require the presence of Preferred Partners?",
        "Is it necessary to have Preferred Partners for the campaign to run?",
        "Can I proceed with the campaign if I don't have any Preferred Partners?",
        "What if I don't have any Preferred Partners in my business network?",
        "Is the campaign feasible without any Preferred Partners?",
        "Do I need to find Preferred Partners to run the campaign?",
        "Is the campaign possible without the involvement of Preferred Partners?",
        "Can I run the campaign without having any Preferred Partners?",
        "What are the options if I don't have any Preferred Partners for the campaign?",
        "Is it still possible to execute the campaign without Preferred Partners?"]
    },
    {
        "tag": "Offers to Preferred Partners",
        "responses": "While offers in your Default Offer Set will go to your Preferred Partners on priority, it does not guarantee that they will not be delivered to customers of other compatible outlets on the XIRCLS network when relevant. This is to ensure that your offers reach as many customers as possible via other outlets. To ensure your offers go only to customers of your Preferred Partners, you must make an Inner XIRCL.",
        "patterns": ["What measures can I take to ensure that my offers are targeted only to customers of my Preferred Partners?",
        "How can I guarantee that my offers reach only the customers of my Preferred Partners?",
        "What steps should I follow to ensure that my offers are exclusively sent to the customers of my Preferred Partners?",
        "Are there any methods I can use to make sure that my offers are received only by the customers of my Preferred Partners?",
        "How do I set up my campaign to ensure that my offers are specifically targeted to the customers of my Preferred Partners?",
        "What strategies can I implement to make certain that my offers are directed solely to the customers of my Preferred Partners?",
        "What actions can I take to restrict my offers to the customers of my Preferred Partners?",
        "Is there a way to verify that my offers are exclusively delivered to the customers of my Preferred Partners?",
        "How do I guarantee that my offers are limited to the customers of my Preferred Partners?",
        "What can I do to ensure that my offers are only received by the customers of my Preferred Partners?",
        "Are there any safeguards I can put in place to ensure that my offers are targeted solely to the customers of my Preferred Partners?",
        "How can I control the distribution of my offers to ensure they are sent only to the customers of my Preferred Partners?",
        "What measures can I implement to make sure that my offers are sent exclusively to the customers of my Preferred Partners?",
        "How do I verify that my offers are specifically delivered to the customers of my Preferred Partners?",
        "What steps should I take to ensure that my offers are exclusively available to the customers of my Preferred Partners?",
        "Are there any mechanisms in place to ensure that my offers are directed solely to the customers of my Preferred Partners?"]
    },
    {
        "tag": "Inner XIRCL",
        "responses": "An Inner XIRCL gives you advanced precision targeting abilities. It is a fixed set of rules applied for targeted delivery of offers to a predefined customer subset.",
        "patterns": ["What is the purpose or function of an Inner Circle?",
        "Can you explain the concept of an Inner Circle?",
        "How does an Inner Circle work?",
        "What are the benefits of being part of an Inner Circle?",
        "How can I join an Inner Circle?",
        "Are there any requirements to become a member of an Inner Circle?",
        "What distinguishes an Inner Circle from other groups or communities?",
        "Can you provide examples of successful Inner Circles?",
        "Is there a fee or cost associated with joining an Inner Circle?",
        "What types of activities or interactions occur within an Inner Circle?",
        "Are there any exclusivity rules within an Inner Circle?",
        "How can I make the most of my membership in an Inner Circle?",
        "What resources or support are available within an Inner Circle?",
        "Do Inner Circles offer any networking opportunities?",
        "Are there any special privileges or perks for members of an Inner Circle?"]
    },
    {
        "tag": "Install a plugin/SDK",
        "responses": "The Get Back All You Spend plugin/SDK helps you smoothly deliver the Get Back All You Spend promise to potential customers of other merchants, as well as your own customers who've returned to shop with you. Once installed into your website/mobile app/POS console, the XIRCLS Get Back All You Spend plugin/SDK will: Identify a customer as new or returning to ensure they only see and receive offers that are relevant to them i.e. either Acquisition or Retention Offers. Automatically display applicable offers to the customer based on contents of his/her cart. Enable your customer to apply an offer with a click. No offer codes to enter manually! Match your customer's spend value with offers from you (the host) and other non-competing XIRCLS merchants. Automatically and instantly issue offers to match spend on completion of every purchase at your Outlet via email and/or SMS (optional, on purchase of SMS pack)",
        "patterns": ["What is the purpose of installing a plugin/SDK?",
        "Why is a plugin/SDK required for this?",
        "What functionality does the plugin/SDK provide?",
        "How does the plugin/SDK enhance my website/mobile app/POS console?",
        "What are the benefits of using the plugin/SDK?",
        "Can you explain the role of the plugin/SDK in this system?",
        "Are there any alternative solutions to using the plugin/SDK?",
        "What happens if I don't install the plugin/SDK?",
        "Is the installation process difficult or time-consuming?",
        "Can you guide me on how to install the plugin/SDK?",
        "Is the plugin/SDK compatible with different platforms or systems?",
        "Are there any security considerations related to the plugin/SDK?",
        "Do I need to update the plugin/SDK regularly?",
        "Can I customize the plugin/SDK to fit my specific needs?",
        "Are there any costs associated with the plugin/SDK installation?",
        "What support or resources are available for troubleshooting plugin/SDK issues?"]
    },
    {
        "tag": "No plugin/SDK?",
        "responses": "It is mandatory to install the plugin/SDK in order to match spends at your outlet with Reward Kits. The campaign cannot run without it.",
        "patterns": ["What are the consequences of not installing the plugin/SDK?",
        "Are there any limitations or restrictions if I don't use the plugin/SDK?",
        "Is it possible to run the campaign with alternative methods instead of the plugin/SDK?",
        "What features or functionalities will be unavailable without the plugin/SDK?",
        "Will not installing the plugin/SDK affect the campaign's performance?",
        "Are there any performance benefits to using the plugin/SDK?",
        "Can I achieve the same results without installing the plugin/SDK?",
        "Are there any alternatives to the plugin/SDK for running the campaign?",
        "Does the plugin/SDK provide additional value or advantages for the campaign?",
        "Can I test the campaign without installing the plugin/SDK?",
        "What data or insights will I miss out on if I don't install the plugin/SDK?",
        "Is the plugin/SDK necessary for accurate campaign tracking and measurement?",
        "Are there any dependencies on the plugin/SDK for campaign optimization?",
        "What are the recommended steps for installing the plugin/SDK?",
        "Is there any support available for troubleshooting plugin/SDK installation issues?",
        "Can I integrate the plugin/SDK at a later stage of the campaign?"]
    },
    {
        "tag": "Get Back All You Spend promise",
        "responses": "With the XIRCLS Get Back All You Spend plugin/SDK, you can advertise the Get Back All You Spend promise via an attractive button on select pages of your outlet website/mobile app. When the button is clicked, a pop-up window explains what customers should expect. You can customize both the button and the pop-up window, as well as choose which pages you want the promise to be displayed.",
        "patterns": ["What are the channels used to communicate the Get Back All You Spend promise?",
        "How can I promote the Get Back All You Spend offer to my customers?",
        "Are there any marketing materials available to advertise the Get Back All You Spend promise?",
        "Will the Get Back All You Spend offer be displayed on my website?",
        "Can I customize the messaging about the Get Back All You Spend promise?",
        "What strategies can I use to inform my website visitors about the Get Back All You Spend offer?",
        "Is there a dedicated landing page for the Get Back All You Spend promise?",
        "Are there any banners or badges I can use to highlight the Get Back All You Spend offer?",
        "Can I leverage social media to spread awareness about the Get Back All You Spend program?",
        "Are there any email templates available to promote the Get Back All You Spend promise?",
        "Will the Get Back All You Spend offer be mentioned in transaction receipts?",
        "Are there any offline advertising options to promote the Get Back All You Spend promise?",
        "How can I educate my staff about the Get Back All You Spend program to relay the information to customers?",
        "Can I include the Get Back All You Spend offer in my promotional campaigns?",
        "Are there any success stories or testimonials I can share to demonstrate the value of the Get Back All You Spend promise?",
        "What are the best practices for effectively communicating the Get Back All You Spend offer?"]
    },
    {
        "tag": "Display Get Back All You Spend promise",
        "responses": "A) To tell everyone about this awesome promise Encourage your customers and first-time visitors to shop with you and spend more while they're at it. B) To treat your customers to a hassle-free redemption When they're about to checkout, logged-in customers are reminded via a pop-up that they have an offer to redeem. Customers can then proceed to apply an offer with a with a single click.",
        "patterns": ["What are the benefits of displaying the Get Back All You Spend promise on my website/mobile app?",
        "How can displaying the Get Back All You Spend offer improve customer engagement?",
        "Will displaying the Get Back All You Spend promise increase customer trust and loyalty?",
        "Can displaying the Get Back All You Spend offer attract new customers to my website/mobile app?",
        "Are there any studies or statistics that show the effectiveness of displaying the Get Back All You Spend promise?",
        "Does displaying the Get Back All You Spend offer help differentiate my business from competitors?",
        "What impact can displaying the Get Back All You Spend promise have on customer satisfaction?",
        "Will displaying the Get Back All You Spend offer encourage repeat purchases from customers?",
        "Are there any visual elements or badges that can be used to highlight the Get Back All You Spend promise?",
        "Can displaying the Get Back All You Spend offer enhance the overall user experience of my website/mobile app?",
        "How can displaying the Get Back All You Spend promise contribute to increased sales and revenue?",
        "What are the best practices for effectively showcasing the Get Back All You Spend offer?",
        "Does displaying the Get Back All You Spend offer align with current market trends and customer expectations?",
        "Can displaying the Get Back All You Spend promise help build a positive brand image and reputation?",
        "Are there any case studies or success stories of businesses that have benefited from displaying the Get Back All You Spend offer?",
        "Will displaying the Get Back All You Spend offer create a sense of urgency and drive immediate customer action?"]
    },
    {
        "tag": "Plugin/SDK data extraction",
        "responses": "XIRCLS takes the data privacy and security of its merchants very seriously. We strive to be 100% transparent about our data collection practices. The only data extracted is what is required for the plugin to function and the only data stored is to ensure relevant offer distribution and the convenient redemption of those offers by your customers. To know more in detail about how the XIRCLS plugin/SDK interacts with your website/mobile app/POS console, go to XIRCLS Plugin / SDK - Addressing Your Concerns about Data Gathering & Security.",
        "patterns": ["What specific data does the plugin/SDK extract from my website/mobile app/POS console?",
        "How does the plugin/SDK ensure data security and privacy?",
        "Are there any measures in place to protect sensitive customer information?",
        "Can I customize the data extraction process to comply with my privacy policies?",
        "Does the plugin/SDK adhere to industry standards for data security?",
        "What steps are taken to encrypt and protect data during transmission?",
        "How long is the data stored and what is the retention policy?",
        "Are there any restrictions on the types of data that can be extracted?",
        "What access controls are in place to prevent unauthorized data access?",
        "Can I review and audit the data extraction process?",
        "Are there any compliance certifications or third-party audits for data security?",
        "Does the plugin/SDK comply with GDPR or other data protection regulations?",
        "Can I revoke or limit the data access of the plugin/SDK at any time?",
        "What happens to the data in case of plugin/SDK updates or removal?",
        "Is there any anonymization or pseudonymization of extracted data?",
        "Are there any data breach response plans in place in case of security incidents?"]
    },
    {
        "tag": "Other merchant offers",
        "responses": "Only YOUR offers are ever displayed on your website. Offers from other merchants do not appear on your website. Your customers will only see the offers of other merchants that you've gifted them in the email/SMS link that your customer will receive after a purchase.",
        "patterns": ["Will offers from other merchants be visible on my website?",
        "Can I control the visibility of offers from other merchants on my website?",
        "How can I customize the display of offers from other merchants?",
        "Are there any options to filter or prioritize offers from specific merchants?",
        "What happens if I don't want to show offers from other merchants?",
        "Can I restrict the display of offers to only my own products or services?",
        "Is there a way to promote my own offers over offers from other merchants?",
        "Are there any guidelines for integrating offers from other merchants on my website?",
        "Can I choose the categories or types of offers displayed from other merchants?",
        "How frequently are offers from other merchants updated or refreshed?",
        "Is there a way to monetize or earn revenue from displaying offers from other merchants?",
        "What level of control do I have over the design and placement of offers from other merchants?",
        "Can I track the performance or click-through rates of offers from other merchants?",
        "Are there any restrictions on the number of offers displayed from other merchants?",
        "Is it possible to collaborate with other merchants for joint promotions or exclusive offers?",
        "How can I ensure the relevance and quality of offers from other merchants?"]
    },
    {
        "tag": "Get Back All You Spend plugin/SDK download",
        "responses": "See the list of e-commerce platforms where the XIRCLS Get Back All You Spend plugin is currently available here. You will also find our XIRCLS JavaScript SDK and REST APIs which offer client and server-side functionalities of the plugin for manual integration with frameworks built-in PHP, Ruby, Python, Java, and ASP.Net.",
        "patterns": ["Where do I download the XIRCLS Get Back All You Spend plugin/SDK?",
        "How can I get the plugin/SDK for the XIRCLS Get Back All You Spend feature?",
        "What is the download process for the XIRCLS Get Back All You Spend plugin/SDK?",
        "Is there a specific website or portal to download the XIRCLS Get Back All You Spend plugin/SDK?",
        "Are there any prerequisites or requirements for downloading the XIRCLS Get Back All You Spend plugin/SDK?",
        "Can I access the XIRCLS Get Back All You Spend plugin/SDK from the developer documentation?",
        "Are there different versions or editions available for the XIRCLS Get Back All You Spend plugin/SDK?",
        "Is the XIRCLS Get Back All You Spend plugin/SDK available for multiple platforms (e.g., web, mobile)?",
        "Do I need to register or create an account to download the XIRCLS Get Back All You Spend plugin/SDK?",
        "Is there a user guide or installation manual available for the XIRCLS Get Back All You Spend plugin/SDK?",
        "Can I find the XIRCLS Get Back All You Spend plugin/SDK in popular app stores or marketplaces?",
        "Are there any licensing or usage terms associated with the XIRCLS Get Back All You Spend plugin/SDK?",
        "Is the XIRCLS Get Back All You Spend plugin/SDK free to download, or is there a cost involved?",
        "How frequently is the XIRCLS Get Back All You Spend plugin/SDK updated or maintained?",
        "Are there any support channels or forums available for users of the XIRCLS Get Back All You Spend plugin/SDK?",
        "Can I integrate the XIRCLS Get Back All You Spend plugin/SDK into multiple websites or applications?"]
    },
    {
        "tag": "Lite, Grow and Pro plans",
        "responses": "The Lite Plan costs Rs.1,779/month and contains everything you need to begin cross-marketing efficiently. It is ideal for small businesses looking for an automated campaign that requires minimal involvement or for budding digital marketers who want to keep things simple to start with. The Grow Plan costs Rs.2,966/month and is ideal for businesses looking to scale up and grow. It allows you to get more in-depth with your strategy and fine-tune your campaign to push for more engagement and conversions. The Grow Plan allows you to create upto 3 users, block upto 5 outlets, create more types of offers, get email template options (5 only), retarget via your partners, send offer reminders and create an exclusive Inner XIRCL (1 only). The Grow Plan also includes email + phone support, more detailed reports/analytics, data backups and disaster recovery. The Pro Plan costs Rs.4,322/month and is recommended for larger companies seeking partner exclusivity in their cross-marketing campaigns and who need advanced customizations to suit their business needs. With the Pro Plan, you can block as many outlets as you wish, create unlimited Inner XIRCLs for multi-level partnerships and create multiple outlets with upto 10 users with customizable user level settings. It also includes all the features from the Grow Plan, such as more types of offer creation, more email template options (20), retargeting via your partners and offer reminders. The Pro Plan includes email + phone support, detailed analytics and reports that include customer behaviour across partner outlets, data backups and disaster recovery. The Pro Plan also includes a personal alliances manager who will work closely with you to understand your business goals and partnership requirements. S/he will reach out to businesses of your choice - both online and offline - and get them onboard XIRCLS for you to cross-market with.",
        "patterns": ["What are the key differences between the Lite, Grow, and Pro plans?",
        "Can you explain the distinctions among the Lite, Grow, and Pro plans?",
        "What features are exclusive to the Lite, Grow, and Pro plans respectively?",
        "Are there any limitations or restrictions specific to the Lite, Grow, or Pro plans?",
        "How does the Lite plan compare to the Grow and Pro plans in terms of functionality?",
        "What additional benefits do the Grow and Pro plans offer compared to the Lite plan?",
        "Are there different pricing structures associated with the Lite, Grow, and Pro plans?",
        "Can I upgrade from the Lite plan to the Grow or Pro plan at any time?",
        "What factors should I consider when choosing between the Lite, Grow, and Pro plans?",
        "Do the Lite, Grow, and Pro plans differ in terms of customer support or assistance?",
        "Are there any usage limitations or thresholds associated with the Lite, Grow, or Pro plans?",
        "Can I switch between the Lite, Grow, and Pro plans without losing my data or settings?",
        "Are there any special promotions or discounts available for the Lite, Grow, or Pro plans?",
        "What is the recommended plan for small businesses/startups, Lite, Grow, or Pro?",
        "Are there any contractual obligations or commitments tied to the Lite, Grow, or Pro plans?",
        "How does the Lite, Grow, and Pro plans cater to different business sizes or requirements?"]
    },
    {
        "tag": "Plan cost GST",
        "responses": "No, the plan costs do not include GST. GST will be charged at the prevalent rate at the time of collecting payment/generating invoice.",
        "patterns": ["Are the plan costs inclusive of GST?",
        "Do I need to pay additional GST charges on top of the plan costs?",
        "Is the GST included in the pricing of the plans?",
        "Are the plan fees subject to GST?",
        "Does the cost of the plans already cover the GST?",
        "Do I have to separately calculate and pay GST for the plan costs?",
        "Is the GST already factored into the pricing structure of the plans?",
        "Are there any GST exemptions or waivers for the plan costs?",
        "Do I receive a GST invoice for the plan charges?",
        "Are the plan prices mentioned inclusive of applicable GST?",
        "Is the GST amount mentioned separately in the plan pricing?",
        "Do I need to add GST to the plan costs while making the payment?",
        "Are there any GST-related terms or conditions for the plan fees?",
        "Is the GST applicable for both monthly and annual plan subscriptions?",
        "Does the GST vary depending on the selected plan tier?",
        "Can I claim input tax credit for the GST paid on the plan expenses?"]
    },
    {
        "tag": "SMS cost",
        "responses": "The SMSes are purchased from a third party and entails a cost that is dependent on your use. We choose to be transparent in our pricing and have kept the SMS costs out of our Subscription Plans. You pay only for what you use. Alternatively, you can opt for 'SMS Gateway Integration' if you want to use your own SMS service provider.",
        "patterns": ["What is the reason for the separate payment for SMS?",
        "Why is SMS not included in the main payment?",
        "Can you explain the rationale behind the separate SMS payment?",
        "Is there a specific purpose for the SMS payment?",
        "What services or features are covered by the SMS payment?",
        "Is the SMS payment optional or mandatory?",
        "Are there any additional benefits associated with the SMS payment?",
        "How does the separate SMS payment impact the overall cost?",
        "Are there different SMS packages or pricing options available?",
        "Can I use my own SMS provider instead of paying separately?",
        "Does the SMS payment vary based on usage or volume?",
        "Are there any discounts or promotions available for the SMS payment?",
        "Is the SMS payment a one-time fee or recurring charge?",
        "Can I pay for SMS on a per-message basis instead of a separate payment?",
        "Are there any limitations or restrictions on the SMS payment?",
        "How does the SMS payment process work?"]
    },
    {
        "tag": "Purchase of SMS Packs",
        "responses": "SMS Packs are required if you wish to send Reward Kits to your customers via SMS. If your business is a website or mobile app, Reward Kits are sent via email to your customers by default. In this case, SMS Packs are not compulsory but still highly recommended. However, if you're a physical, offline outlet such as a store, restaurant, gym, etc., do not collect email addresses of customers and wish to deliver Reward Kits to your customers against their mobile number, offer delivery via SMS is the only option. In such a case, purchase of SMS Packs becomes mandatory.",
        "patterns": ["Is it mandatory to purchase SMS packs?",
        "Do I have to buy SMS packs?",
        "What happens if I don't purchase SMS packs?",
        "Can I opt-out of purchasing SMS packs?",
        "Are SMS packs necessary for using the service?",
        "What are the benefits of purchasing SMS packs?",
        "Are there any alternatives to purchasing SMS packs?",
        "Can I use my own SMS provider instead of buying packs?",
        "Do SMS packs offer any discounts or cost savings?",
        "Are there different options for SMS pack sizes?",
        "How does not purchasing SMS packs affect the service?",
        "Are there any limitations for users who don't buy SMS packs?",
        "Is there a trial period for SMS packs?",
        "What happens if I exceed the SMS limit without purchasing packs?",
        "Can I purchase SMS packs at a later time?",
        "How does purchasing SMS packs impact the overall cost?"]
    },
    {
        "tag": "Billing Plan",
        "responses": "All our plans give you the choice of either Quarterly, Half Yearly or Yearly payments, payable before the selected period begins. Note: Choosing Yearly billing under the Plans results in greater savings.",
        "patterns": ["What is the billing frequency for plan subscriptions?",
        "Is the plan subscription billed monthly or quarterly?",
        "How often is the billing done for plan subscriptions?",
        "Is the billing cycle for plan subscriptions monthly or quarterly?",
        "Are plan subscriptions billed on a monthly or quarterly basis?",
        "What is the frequency of billing for plan subscriptions?",
        "Do I need to pay for the plan subscription monthly or quarterly?",
        "Is the billing for plan subscriptions done on a monthly or quarterly basis?",
        "Are there any discounts for quarterly plan subscriptions?",
        "Is there an option for annual billing for plan subscriptions?",
        "Can I switch from monthly billing to quarterly billing for plan subscriptions?",
        "Is the billing for plan subscriptions pro-rated?",
        "Are there any additional fees associated with the billing of plan subscriptions?",
        "How can I change the billing frequency for my plan subscription?",
        "What happens if I miss a payment for my plan subscription?",
        "Can I cancel my plan subscription mid-billing cycle?"]
    },
    {
        "tag": "Plan activity",
        "responses": "Yes, the plan is active from the moment of your purchase.",
        "patterns": ["What is the status of my purchased plan if I haven't started my campaign yet?",
        "Is my plan active even if I haven't initiated my campaign?",
        "Does my plan become active immediately after purchase?",
        "Can I start my campaign later after purchasing the plan?",
        "What happens to my plan if I haven't used it for a campaign yet?",
        "Is my plan automatically activated upon purchase?",
        "How can I check the status of my plan if I haven't started my campaign?",
        "Can I activate my plan at a later date after purchase?",
        "Will my plan be active even if I haven't launched a campaign?",
        "What is the validity of my plan if I haven't utilized it yet?",
        "Can I delay the activation of my plan after purchase?",
        "Do I need to take any action to activate my plan if I haven't started my campaign?",
        "Is my plan considered active even if I haven't initiated any campaigns?",
        "What should I do if I haven't started my campaign but have purchased a plan?",
        "Will my plan expire if I haven't used it within a certain period?",
        "Can I postpone the activation of my plan after purchase?"]
    },
    {
        "tag": "Stopped campaign",
        "responses": "Yes, the plan will remain active even if you've temporarily stopped your campaign.",
        "patterns": ["If I temporarily pause my campaign while on a plan, will my plan remain active?",
        "Does my plan stay active if I temporarily stop my campaign?",
        "What happens to my plan if I temporarily halt my campaign?",
        "If I pause my campaign, does it affect the status of my plan?",
        "Will my plan be active even if I temporarily suspend my campaign?",
        "Does stopping my campaign temporarily impact the activation of my plan?",
        "Can I temporarily pause my campaign while on a plan without affecting its status?",
        "If I halt my campaign temporarily, will my plan continue to be active?",
        "What happens to my plan if I stop my campaign temporarily?",
        "Will my plan remain active if I temporarily put my campaign on hold?",
        "Does pausing my campaign temporarily affect the validity of my plan?",
        "Can I stop my campaign temporarily without deactivating my plan?",
        "If I temporarily suspend my campaign, will my plan still be considered active?",
        "Does the activation of my plan continue even if I temporarily stop my campaign?",
        "Will my plan be valid if I temporarily stop my campaign?",
        "If I pause my campaign temporarily, will my plan duration be extended?"]
    },
    {
        "tag": "Plan expiry",
        "responses": "If you do not use up the allocated number of deliverable offers in your plan before expiry, the offers will get carried over when you renew/upgrade your plan. Your dashboard will reflect this once you've purchased the plan.",
        "patterns": ["If my plan expires before using up all the allocated deliverable offers, what happens?",
        "What if I haven't used all the deliverable offers before my plan expires?",
        "Does my plan's expiration impact the unused deliverable offers?",
        "If I still have deliverable offers left when my plan expires, what occurs?",
        "What happens to the unused deliverable offers if my plan expires?",
        "Can I utilize the remaining deliverable offers after my plan's expiration?",
        "Will the unutilized deliverable offers carry over if my plan expires?",
        "If my plan ends before using up all the deliverable offers, what's the outcome?",
        "What occurs if I have unused deliverable offers and my plan expires?",
        "Do the unused deliverable offers expire when my plan comes to an end?",
        "If I haven't exhausted the deliverable offers and my plan expires, what's the status?",
        "Will the remaining deliverable offers be valid after my plan's expiration?",
        "If my plan ends before using all the deliverable offers, can I still utilize them?",
        "What happens if I have unused deliverable offers and my plan's validity ends?",
        "Do the deliverable offers become void if my plan expires?",
        "If my plan expires, can I still redeem the remaining deliverable offers?"]
    },
    {
        "tag": "Renew/upgrade to a new plan",
        "responses": "You can renew/upgrade your plan at any time. All remaining deliverable offers will be carried over to the new plan.",
        "patterns": ["What is the process to renew or upgrade my plan before it expires?",
        "How can I upgrade or renew my plan while it's still active?",
        "What steps should I follow to renew or upgrade my plan before its expiration?",
        "Can you guide me on renewing or upgrading my plan before it ends?",
        "I want to renew or upgrade my plan before it expires. What should I do?",
        "Is it possible to extend or upgrade my plan prior to its expiration?",
        "What are the options available to renew or upgrade my plan before it ends?",
        "How do I go about renewing or upgrading my plan before its expiry?",
        "If I want to renew or upgrade my plan, what's the procedure before it expires?",
        "What should I do if I want to renew or upgrade my plan before its expiration?",
        "I would like to renew or upgrade my plan before it expires. How can I do that?",
        "Can you provide guidance on renewing or upgrading my plan before it ends?",
        "Before my plan expires, how can I renew or upgrade it?",
        "What actions do I need to take to renew or upgrade my plan before it expires?",
        "Is there a process to renew or upgrade my plan before it reaches its expiration date?"]
    },
    {
        "tag": "Refund policy",
        "responses": "We offer a no-patternss-asked 100% refund guarantee. To ensure that you do not have to pay for something you may not want, we allow you to cancel your subscription plan anytime and you will be refunded 100% of your hard-earned money for the remainder period of the plan. eg: You have paid Rs. 23,988/- + GST for a 12-month plan and decide to cancel after 45 days. You will be charged only for the 45 days that you have used the service and will be refunded Rs. 20,989.50 for the balance period of 10 months and 15 days. In case there are outstanding payments against Overage Charges, the Overage Charges will be deducted and the balance amount refunded. The 100% Refund Guarantee period shall begin after the 14-Day Free Trial period.",
        "patterns": ["Can you explain the details of your refund policy?",
        "What is the refund policy for your services?",
        "How does your refund policy work?",
        "Can you provide information about your policy regarding refunds?",
        "What are the terms of your refund policy?",
        "Do you have a specific refund policy in place?",
        "Is there a refund policy for your products or services?",
        "What should I know about your refund policy?",
        "Are refunds available as per your policy?",
        "Can you outline your policy for refunds?",
        "What is the procedure for requesting a refund?",
        "Are there any conditions or restrictions on your refund policy?",
        "Is there a time limit for requesting a refund?",
        "Do you offer full or partial refunds?",
        "Are refunds processed automatically or manually?",
        "Are there any exceptions to your refund policy?"]
    },
    {
        "tag": "Support inclusion in price",
        "responses": "Full email support is included in all our plans and email + phone support is included in our Grow and Pro plans for no additional charge.",
        "patterns": ["Does the price include support or is it an additional charge?",
        "Is support part of the package price or is it billed separately?",
        "Is support included in the pricing or is it an extra cost?",
        "Do I have to pay for support separately or is it already covered in the price?",
        "What is the policy regarding support charges?",
        "Is there an additional fee for support or is it already accounted for in the price?",
        "Is support provided at no extra cost or is it chargeable?",
        "Does the price of the product/service include support assistance?",
        "Is there a separate charge for support or is it included in the overall cost?",
        "Is support billed separately or is it bundled with the pricing?",
        "What are the terms for support charges?",
        "Is there a cost associated with accessing support?",
        "Do I need to pay extra for support services?",
        "Are there any limitations or restrictions on the included support?",
        "Is support offered as part of the standard pricing or is it an optional add-on?"]
    },
    {
        "tag": "Additional charges",
        "responses": "Once your campaign reaches the limit on the number of offers distributable under the plan, an overage charge per customer reached is charged as specified in that particular plan.",
        "patterns": ["What additional charges should I expect after purchasing a plan?",
        "Are there any extra costs involved once I've bought a plan?",
        "Do I need to pay anything extra after I've purchased a plan?",
        "Are there any supplementary fees following the purchase of a plan?",
        "What are the potential additional expenses after buying a plan?",
        "Are there any added charges subsequent to plan purchase?",
        "Do I have to incur any additional costs after getting a plan?",
        "Are there any further payments required after I've acquired a plan?",
        "What other fees are there post-plan purchase?",
        "Will there be any extra charges after I've made a plan purchase?",
        "Are there any hidden costs after I've obtained a plan?",
        "Do I need to pay for any extras once I've bought a plan?",
        "What are the potential additional fees associated with a plan purchase?",
        "Are there any additional expenses beyond the initial plan purchase?",
        "Will there be any supplementary charges after I've acquired a plan?"]
    },
    {
        "tag": "Overage billing",
        "responses": "Overage charges are billed on a monthly basis only when offer distribution has gone beyond the plan limit usage. In case of overage, the invoice will be emailed to you at the end of every month and can also be accessed from your merchant dashboard on XIRCLS. Payment can be made via secure payment options available on your dashboard.",
        "patterns": ["How will excess usage be invoiced?",
        "What is the billing process for overage?",
        "How are additional charges calculated for exceeding limits?",
        "What happens if I exceed my allocated usage?",
        "Will there be any extra charges for going over the limits?",
        "How will overage fees be applied to my account?",
        "What is the billing procedure for exceeding the allotted usage?",
        "Do I need to pay for exceeding the usage limits?",
        "What are the charges for going beyond the allocated limits?",
        "Will I be billed for exceeding the allocated usage?",
        "How is overage billing handled?",
        "What is the cost associated with exceeding usage limits?",
        "Will there be any additional fees for exceeding usage?",
        "What happens if I go over the allowed limits?",
        "Are there any charges for surpassing the allocated usage?",
        "How is the billing done for overage?"]
    },
    {
        "tag": "Non-payment of overage",
        "responses": "On non-payment of overage charges over 30 days, your campaign will be stopped i.e. distribution of Retention Offers & Reward Kits to your customers will be stopped and your Acquisition Offers will no longer be issued to customers of your Preferred Partners and other compatible merchants on the XIRCLS network.",
        "patterns": ["What are the consequences of non-payment for overage?",
        "What happens if I don't pay for exceeding my limits?",
        "Are there any penalties for non-payment of overage charges?",
        "What are the repercussions of not paying for excess usage?",
        "Will there be any actions taken for non-payment of overage fees?",
        "What happens if I fail to pay for going over the allocated limits?",
        "Are there any penalties for not paying for overage?",
        "What are the implications of non-payment for exceeding usage?",
        "What are the consequences of not paying for surpassing the limits?",
        "Will there be any penalties for non-payment of exceeding limits?",
        "What happens if I don't pay for going over the allowed usage?",
        "Are there any repercussions for non-payment of overage charges?",
        "What are the actions taken for not paying for excess usage?",
        "Will there be any consequences for non-payment of overage fees?",
        "What happens if I fail to pay for exceeding the allocated usage?",
        "Are there any penalties for not paying for overage charges?"]
    },
    {
        "tag": "Types of Payments",
        "responses": "We accept payments via Visa, MasterCard, Paypal. We also accept payments via bank transfer or cheque. For more details, please contact support@xircls.com",
        "patterns": ["What payment methods do you accept?",
        "Which payment options are available?",
        "What types of payments are supported?",
        "Do you accept credit card payments?",
        "Are debit cards accepted as a form of payment?",
        "Can I pay using PayPal?",
        "What are the accepted payment gateways?",
        "Do you support online banking transfers?",
        "Are cryptocurrency payments accepted?",
        "Which digital wallets can I use to make payments?",
        "Is Apple Pay or Google Pay accepted?",
        "What forms of payment are allowed?",
        "Can I pay using a bank transfer?",
        "Do you accept payment via mobile wallets?",
        "Which payment processors do you work with?",
        "Are there any specific payment restrictions or limitations?"]
    },
    {
        "tag": "Currency of Billing",
        "responses": "Currently, we're billing only in INR.",
        "patterns": ["In which currencies can I be billed?",
        "What are the supported billing currencies?",
        "Which currency options are available for billing?",
        "Do you support multiple currencies for billing?",
        "Can I choose the currency for my billing?",
        "What is the default billing currency?",
        "Are there any restrictions on billing currencies?",
        "Is billing available in different currencies?",
        "Do you offer billing in international currencies?",
        "Are there any additional charges for currency conversion in billing?",
        "Which exchange rates are used for billing?",
        "Can I change the billing currency later?",
        "Do you provide currency conversion services for billing?",
        "What happens if my preferred billing currency is not available?",
        "Are there any limitations on the available billing currencies?"]
    },
    {
        "tag": "More Questions?",
        "responses": "Get in touch with us on support@xircls.com and we'll be happy to answer any other questions you may have.",
        "patterns": ["I have more questions. What do I do?",
        "What other questions can I ask?",
        "Do you have a list of frequently asked questions?",
        "How can I get more information?",
        "Where can I find additional answers?",
        "Is there a help center or documentation available?",
        "Are there any resources for further clarification?",
        "Can you provide more details on specific topics?",
        "How can I contact support for further assistance?",
        "Do you offer live chat support for inquiries?",
        "What channels are available for asking questions?",
        "Are there any community forums or discussion boards?",
        "Can I request a demo or walkthrough of the product?",
        "Is there a dedicated support team to address queries?",
        "Are there any training materials or tutorials available?",
        "Do you provide assistance with troubleshooting?",
        "Are there any FAQs or knowledge base articles?"]
    },
    {
        "tag": "Semper Fi",
        "responses": "Semper Fi is the only loyalty program in the world where other businesses reward your customers for shopping with you. It is a 100% automated rewards system that identifies your most ideal partner businesses on the XIRCLS network and issues their offers to your customers as a reward for making a purchase at your outlet.",
        "patterns": ["What is Semper Fi?",
        "Can you explain the meaning of Semper Fi?",
        "What does Semper Fi stand for?",
        "Where does the term Semper Fi come from?",
        "What is the origin of Semper Fi?",
        "Why is Semper Fi associated with the military?",
        "Is Semper Fi a motto or slogan?",
        "What is the significance of Semper Fi?",
        "Are there any traditions related to Semper Fi?",
        "How is Semper Fi used in the military context?",
        "Are there different interpretations of Semper Fi?",
        "Can you provide examples of Semper Fi in action?",
        "Are there any notable individuals associated with Semper Fi?",
        "Does Semper Fi have any cultural impact?",
        "Are there any variations or similar phrases to Semper Fi?",
        "Is Semper Fi exclusive to a particular branch of the military?",
        "Where can I learn more about Semper Fi?"]
    },
    {
        "tag": "Meaning of Semper Fi",
        "responses": "Semper Fi is a shortened form of the Latin phrase, 'Semper Fidelis', which means 'Always Loyal'.",
        "patterns": ["What does Semper Fi mean?",
        "What is the meaning of Semper Fi?",
        "Can you explain the significance of Semper Fi?",
        "Where does the term Semper Fi originate from?",
        "What is Semper Fi",
        "How is Semper Fi?",
        "Are there any interpretations of Semper Fi?",
        "What are the cultural associations of Semper Fi?",
        "Can you tell me about Semper Fi?",
        "Does Semper Fi have any historical background?",
        "Are there any notable figures associated with Semper Fi?",
        "inform me about semper fi",
        "Where can I find more information about semper fi?",
        "What is the historical significance of Semper Fi?",
        "What is this Semper fi?",
        "I want to know about semper Fi?"]
    },
    {
        "tag": "Working of Semper Fi",
        "responses": "Semper Fi is an instant and perpetual loyalty program that rewards your customers every time they shop with you. Every time a customer buys, she will instantly receive an email (SMS optional) from your outlet, informing her that as a reward for her purchase, you're gifting her offers from other businesses. You can also choose to send your customers a Loyalty Offer from you that they can redeem the next time they buy at your outlet. See a visual depiction of this process here.",
        "patterns": ["How does Semper Fi work?",
        "How does Semper Fi operate?",
        "Can you explain the mechanics of Semper Fi?",
        "What are the workings of Semper Fi?",
        "How is Semper Fi implemented?",
        "In what way does Semper Fi function?",
        "What is the operational concept behind Semper Fi?",
        "How do individuals engage with Semper Fi?",
        "Are there specific steps involved in Semper Fi?",
        "Can you break down the process of Semper Fi?",
        "What are the components of Semper Fi?",
        "Does Semper Fi follow a particular framework?",
        "What is the methodology behind Semper Fi?",
        "Are there any guidelines for Semper Fi?",
        "Can you provide examples of Semper Fi in action?",
        "Are there any case studies related to Semper Fi?"]
    },
    {
        "tag": "Offers to customers",
        "responses": "You cannot choose offers, but you can choose the businesses whose offers get sent to your customers. Add other outlets as Preferred Partners to give their offers priority during rewards issuance to your customers. Grow & Pro plan users can also create an Inner XIRCL and choose businesses to exclusively send only their offers to customers.",
        "patterns": ["Can I choose which offers go to my customers?",
        "Is it possible to select the specific offers for my customers?",
        "Can I have control over which offers are delivered to my customers?",
        "Do I get to choose the offers that go to my customers?",
        "Are there options to customize the offers for my customers?",
        "Is there flexibility in deciding which offers are sent to my customers?",
        "Am I allowed to determine which offers are directed to my customers?",
        "Are there provisions to personalize the offers for my customers?",
        "Can I pick and choose the offers for my customers?",
        "Is it up to me to decide which offers are offered to my customers?",
        "Do I have the freedom to select the offers for my customers?",
        "Are there tools available to customize the offers for my customers?",
        "Can I customize the offers based on my customers' preferences?",
        "Are there features that enable me to tailor the offers for my customers?",
        "Do I have the ability to personalize the offers based on customer requirements?",
        "Can I specify which offers are sent to specific customers?"]
    },
    {
        "tag": "Loyalty Offers to customers",
        "responses": "Yes, of course! You can create Loyalty Offers and choose to send a relevant one along with the other partner offers or send it separately to your customer, at a later date.",
        "patterns": ["Can I also give an offer from my end to my customers?",
        "Is it possible for me to offer my own deals to my customers as well?",
        "Can I provide additional offers directly to my customers?",
        "Am I allowed to give special promotions to my customers from my end?",
        "Is there an option to offer exclusive deals from my side to my customers?",
        "Can I personally provide offers to my customers on top of the existing ones?",
        "Do I have the ability to give my own offers to my customers?",
        "Are there provisions for me to offer additional deals to my customers?",
        "Can I extend my own offers to my customers alongside the existing ones?",
        "Is it allowed for me to present my own offers to my customers?",
        "Am I permitted to include my own offers for my customers?",
        "Can I include personalized offers from my end for my customers?",
        "Do I have the option to give special discounts directly to my customers?",
        "Are there features that enable me to offer custom deals to my customers?",
        "Can I extend exclusive offers from my end to my customers?",
        "Is it possible for me to provide unique offers to my customers?",
        "Can I give additional incentives from my side to my customers?"]
    },
    {
        "tag": "XIRCLS details visibility",
        "responses": "No. the XIRCLS name will not be visible to your customers. All emails & SMSes go under your business name.",
        "patterns": ["Will the XIRCLS logo or any other marketing be visible to my customers?",
        "Is there any XIRCLS branding or marketing that my customers will see?",
        "Are there any visible XIRCLS elements or branding for my customers?",
        "Will my customers be able to see the XIRCLS logo or any marketing materials?",
        "Are there any XIRCLS promotional materials that my customers will encounter?",
        "Is the XIRCLS logo or any other marketing content displayed to my customers?",
        "Will there be any XIRCLS branding or promotional materials visible to my customers?",
        "Are my customers exposed to the XIRCLS logo or any marketing materials?",
        "Is there any XIRCLS branding or promotional content that my customers can see?",
        "Will the XIRCLS logo or any marketing collateral be shown to my customers?",
        "Are there any visible XIRCLS elements or promotional materials for my customers?",
        "Will my customers come across the XIRCLS logo or any marketing assets?",
        "Is the XIRCLS logo or any promotional content visible to my customers?",
        "Will there be any XIRCLS branding or marketing materials seen by my customers?",
        "Are my customers presented with the XIRCLS logo or any marketing content?",
        "Is there any XIRCLS branding or promotional content that my customers will notice?"]
    },
    {
        "tag": "Offer from outlet",
        "responses": "While sending partner offers is a great incentive for your customers, for Semper Fi to work effectively as a loyalty program, an offer from your outlet is essential. This encourages the customer even more so to shop with you again and receive more partner offers on her next purchase with you.",
        "patterns": ["Why must I create a Loyalty Offer if I'm sending partner offers to my customers?",
        "What is the purpose of creating a Loyalty Offer when sending partner offers?",
        "How does creating a Loyalty Offer relate to sending partner offers to customers?",
        "What is the significance of having a Loyalty Offer when sending partner offers?",
        "Why is it necessary to create a Loyalty Offer alongside partner offers?",
        "What role does a Loyalty Offer play when sending partner offers to customers?",
        "What benefits does creating a Loyalty Offer provide when sending partner offers?",
        "Why is it important to include a Loyalty Offer with partner offers for customers?",
        "How does the creation of a Loyalty Offer complement sending partner offers?",
        "What advantages come from having a Loyalty Offer while sending partner offers?",
        "Why is the creation of a Loyalty Offer recommended when sending partner offers?",
        "What impact does a Loyalty Offer have on the delivery of partner offers to customers?",
        "Why should I consider creating a Loyalty Offer along with partner offers?",
        "What is the rationale behind having a Loyalty Offer in addition to partner offers?",
        "Why is it advisable to include a Loyalty Offer when sending partner offers?",
        "How does a Loyalty Offer enhance the experience of receiving partner offers?"]
    },
    {
        "tag": "Kinds of Loyalty Offers",
        "responses": "Semper Fi gives you the freedom to create 4 types of offers, depending on your product/service and the type of discount you want to give. Flat Discount Offer Percentage Discount Offer Free Products/Service/Voucher Buy One Get One Free",
        "patterns": ["What kind of Loyalty Offers can I create for my customers?",
        "What are the different types of Loyalty Offers that I can offer to customers?",
        "What options do I have when creating Loyalty Offers for my customers?",
        "Can you provide examples of the Loyalty Offers that I can create?",
        "How can I customize the Loyalty Offers for my customers?",
        "Are there any restrictions on the types of Loyalty Offers I can create?",
        "What features and benefits can be included in Loyalty Offers for customers?",
        "Do I have the flexibility to design unique Loyalty Offers?",
        "Are there any limitations on the types of rewards in Loyalty Offers?",
        "Can I offer different tiers or levels of Loyalty Offers to customers?",
        "What criteria can I use to segment Loyalty Offers for specific customers?",
        "Are there any guidelines or best practices for creating Loyalty Offers?",
        "Can I create time-limited or promotional Loyalty Offers?",
        "How can I track and measure the effectiveness of Loyalty Offers?",
        "Are there any recommended strategies for promoting Loyalty Offers to customers?",
        "Can I integrate Loyalty Offers with other marketing campaigns or programs?"]
    },
    {
        "tag": "Recommended Loyalty Offers",
        "responses": "We would recommend creating at least 3 Loyalty Offers that cover different customer spend ranges. E.g. If you've created a Percentage Discount Offer of 15% off on spend of Rs.1000-Rs.2500, create another offer that covers a lower spend range, such as Rs.300-Rs.99This will ensure there is an attractive offer for every kind of customer who shops with you.",
        "patterns": ["How many Loyalty Offers should I create?",
        "Is there a recommended number of Loyalty Offers to offer my customers?",
        "What is the optimal quantity of Loyalty Offers to create?",
        "Should I create multiple Loyalty Offers or focus on a single one?",
        "How does the number of Loyalty Offers impact customer engagement?",
        "Are there any guidelines for determining the number of Loyalty Offers?",
        "What factors should I consider when deciding the number of Loyalty Offers?",
        "Can I create different types of Loyalty Offers with varying quantities?",
        "What are the advantages of having a larger number of Loyalty Offers?",
        "Are there any disadvantages to creating too many Loyalty Offers?",
        "Can I start with a few Loyalty Offers and add more later?",
        "Do customers prefer a greater selection of Loyalty Offers?",
        "How can I determine the right balance of Loyalty Offers for my business?",
        "What are some industry standards or benchmarks for Loyalty Offer quantities?",
        "Can I A/B test different numbers of Loyalty Offers to see which performs better?",
        "Are there any case studies or success stories related to Loyalty Offer quantities?"]
    },
    {
        "tag": "Loyalty Offers for outlets",
        "responses": "Loyalty Offers are issued based on how much the customer has just spent at your outlet. E.g. If you have two offers - 10% off on spend of Rs.500-Rs.1000 and Rs.300 off on spend of Rs.1000-Rs.2500 - and your customer has just spent Rs.600 at your outlet, she will receive the 10% off offer.However, when the customer logs into your outlet website to redeem her offer, she will see both offers and can choose to redeem any one.",
        "patterns": ["How do I know which Loyalty Offer my customer will receive?",
        "Is there a way to determine which Loyalty Offer a specific customer will get?",
        "What factors are considered in assigning Loyalty Offers to customers?",
        "Can I customize the selection of Loyalty Offers for individual customers?",
        "How does the system decide which Loyalty Offer to give to a customer?",
        "Are there any algorithms or rules used to determine the assigned Loyalty Offer?",
        "Is there a specific criteria for matching customers with Loyalty Offers?",
        "Can I preview or test which Loyalty Offer a customer is eligible for?",
        "Do customers have any control over the Loyalty Offer they receive?",
        "Is there a preference given to certain customers when assigning Loyalty Offers?",
        "What happens if a customer qualifies for multiple Loyalty Offers?",
        "Can I track which Loyalty Offers are redeemed by each customer?",
        "Are there any analytics or reports available to understand the Loyalty Offer assignment process?",
        "Can I manually override the assigned Loyalty Offer for a customer?",
        "Are there any best practices for maximizing the relevance of assigned Loyalty Offers?",
        "How can I ensure that customers receive the most suitable Loyalty Offers?"]
    },
    {
        "tag": "Display of Loyalty Offers",
        "responses": "Displaying all Loyalty Offers to your logged-in returning customers is an upselling technique to encourage your customers to spend more or buy a particular product/service to enjoy more savings. Note: The customer can redeem only one Loyalty Offer while checking out.",
        "patterns": ["Why does the customer see all my Loyalty Offers when she logs into my outlet website?",
        "Is there a specific reason why all Loyalty Offers are visible to customers on my website?",
        "Can I control the visibility of Loyalty Offers on my outlet website?",
        "What determines the display of Loyalty Offers to customers on my website?",
        "Are there any settings or configurations to limit the visibility of Loyalty Offers to customers?",
        "How can I restrict the number of Loyalty Offers shown to customers on my website?",
        "Is it possible to customize which Loyalty Offers are displayed to customers on my website?",
        "Do customers have the option to filter or sort the displayed Loyalty Offers on my website?",
        "Is there a way to personalize the Loyalty Offers shown to each customer on my website?",
        "Are all Loyalty Offers visible to customers regardless of their eligibility?",
        "Can I show different sets of Loyalty Offers to different customer segments on my website?",
        "What are the benefits of displaying all Loyalty Offers to customers on my website?",
        "Can I provide explanations or descriptions for the Loyalty Offers displayed on my website?",
        "How can I optimize the visibility of Loyalty Offers to increase customer engagement?",
        "Are there any guidelines for managing the visibility of Loyalty Offers on my website?",
        "Is there a way to track the effectiveness of displaying all Loyalty Offers to customers?"]
    },
    {
        "tag": "Loyalty Offers to first time users",
        "responses": "No. Your Loyalty Offers will never be displayed to visitors who are making their first purchase on the website.",
        "patterns": ["Will my Loyalty Offers be displayed to a user who's never shopped with me before and is logged in for the first time?",
        "What is the visibility of Loyalty Offers for new customers who have never made a purchase?",
        "Do first-time users see any Loyalty Offers when they log in to my platform?",
        "Are there any specific conditions for displaying Loyalty Offers to new customers?",
        "How does the system handle the display of Loyalty Offers to users who haven't shopped with me before?",
        "Can I customize the display of Loyalty Offers for users who are logging in for the first time?",
        "What are the rules regarding showing Loyalty Offers to new users without any purchase history?",
        "Is there a way to encourage new customers with special Loyalty Offers upon their first login?",
        "Are Loyalty Offers visible to users who have never interacted with my business before?",
        "Do I have control over the visibility of Loyalty Offers for first-time logged-in users?",
        "What determines whether a new user will see any Loyalty Offers upon their initial login?",
        "Can I configure Loyalty Offers to target new customers specifically?",
        "How can I make a good impression on new customers with appealing Loyalty Offers?",
        "Are there any restrictions on displaying Loyalty Offers to users who haven't made a purchase yet?",
        "What strategies can I use to engage new users with relevant Loyalty Offers?",
        "Is there a way to track the effectiveness of displaying Loyalty Offers to first-time users?"]
    },
    {
        "tag": "Loyalty Offers Expiry",
        "responses": "At least one active Loyalty Offer is mandatory to run a Semper Fi campaign. If all your Loyalty Offers expire, your campaign will automatically stop. To resume the campaign, you must create a new Loyalty Offer or update offer validity on your existing offer/s.",
        "patterns": ["Will my campaign keep running if all my Loyalty Offers expire?",
        "What happens to my campaign if all the Loyalty Offers reach their expiration date?",
        "Does my campaign continue even after all the Loyalty Offers have expired?",
        "If all my Loyalty Offers expire, does the campaign still remain active?",
        "What is the status of my campaign when all the Loyalty Offers have expired?",
        "Do I need to renew my campaign if all the Loyalty Offers become invalid?",
        "Will the campaign pause once all the Loyalty Offers expire?",
        "If my Loyalty Offers expire, does it affect the continuity of my campaign?",
        "Can my campaign continue running without any active Loyalty Offers?",
        "What happens to my campaign's performance when all the Loyalty Offers expire?",
        "Do expired Loyalty Offers impact the duration of my campaign?",
        "Does the campaign automatically end when all the Loyalty Offers expire?",
        "Can I extend my campaign even if all the Loyalty Offers have expired?",
        "If the Loyalty Offers are no longer valid, does the campaign terminate?",
        "What measures should I take if all the Loyalty Offers in my campaign expire?",
        "Is there a way to keep my campaign active even after the Loyalty Offers expire?"]
    },
    {
        "tag": "Customizing website elements",
        "responses": "Absolutely. You can customize the button type, position and appearance of the pop-up box via the plugin settings.",
        "patterns": ["Can I customize the button and pop-up box that appears on my website?",
        "Is it possible to personalize the button and pop-up box displayed on my website?",
        "Do I have the option to modify the button and pop-up box on my website?",
        "Can I change the appearance of the button and pop-up box on my website?",
        "Is there a way to customize the button and pop-up box that shows up on my website?",
        "What level of customization is available for the button and pop-up box on my website?",
        "Am I allowed to personalize the button and pop-up box on my website?",
        "Does the platform provide options to customize the button and pop-up box on my website?",
        "Can I adjust the design of the button and pop-up box that is visible on my website?",
        "Are there any customization features for the button and pop-up box on my website?",
        "Is it possible to modify the button and pop-up box's layout on my website?",
        "Do I have control over the button and pop-up box's appearance on my website?",
        "Can I change the button and pop-up box's style on my website?",
        "Are there any options to personalize the button and pop-up box's look on my website?",
        "Is the button and pop-up box on my website customizable?",
        "What customization options are available for the button and pop-up box on my website?"]
    },
    {
        "tag": "Website integration",
        "responses": "Yes, XIRCLS will remotely handle the integration for you.",
        "patterns": ["I don't have a technical team to do the website integration for me. Can you help?",
        "Is assistance available if I lack a technical team to handle the website integration?",
        "Can you provide support if I don't have a technical team for website integration?",
        "What options are there for website integration if I don't have a technical team?",
        "Is there assistance for website integration if I lack a technical team?",
        "Do you offer help with website integration if I don't have a technical team?",
        "Can you assist with website integration if I don't have technical expertise?",
        "What resources are available for website integration if I lack a technical team?",
        "Is there support for non-technical users in website integration?",
        "Do you provide guidance for website integration if I don't have a technical team?",
        "Can you help with the website integration process if I'm not technically skilled?",
        "What help is offered for website integration if I lack a technical team?",
        "Is technical assistance provided for website integration if I don't have a team?",
        "Do you offer services to assist with website integration if I lack technical expertise?",
        "Can I get help with website integration if I don't have a technical team?",
        "What solutions are available for website integration if I lack technical resources?"]
    },
    {
        "tag": "Testing without integration",
        "responses": "No problem! You can always manually issue offers to your customers. Simply login to the the XIRCLS dashboard on your computer or mobile phone, enter the customer's email address/mobile number and amount spent and issue rewards instantly - anywhere you are!",
        "patterns": ["I want to try this out but don't want to do any integration with my website/POS.",
        "Is it possible to test this without integrating it with my website/POS?",
        "Can I experiment with this without having to integrate it with my website/POS?",
        "What options are available for trying this out without website/POS integration?",
        "Is there a way to test this without connecting it to my website/POS?",
        "Do I need to integrate this with my website/POS to give it a try?",
        "Can I explore this without any website/POS integration?",
        "What are the alternatives to integrating this with my website/POS for testing purposes?",
        "Is there a trial version available that doesn't require website/POS integration?",
        "Can I evaluate this without the need for website/POS integration?",
        "Is it possible to use this temporarily without integrating it with my website/POS?",
        "What are the options for trying this out without website/POS integration?",
        "Can I experiment with this solution without integrating it with my website/POS?",
        "Is there a sandbox environment available for testing without website/POS integration?",
        "Are there ways to experience this without connecting it to my website/POS?",
        "What are the alternatives to integrating this with my website/POS for trial purposes?"]
    },
    {
        "tag": "SMS Provider",
        "responses": "Yes, you can. XIRCLS will assist you with SMS integration.",
        "patterns": ["I already have an SMS provider. Can I use that service to send SMSes?",
        "Is it possible to integrate my existing SMS provider for sending SMSes?",
        "Can I connect my current SMS service to send SMSes through it?",
        "What options are available for utilizing my existing SMS provider?",
        "Can I leverage my current SMS service to send SMSes?",
        "Do I need to switch my SMS provider to use this service?",
        "Is there a way to integrate my existing SMS provider with this service?",
        "What are the alternatives for sending SMSes through my current SMS provider?",
        "Is it compatible with my current SMS service for sending SMSes?",
        "Can I continue using my current SMS provider for SMS functionality?",
        "Is it possible to work with my existing SMS provider to send SMSes?",
        "What are the options for using my current SMS provider with this service?",
        "Can I integrate my current SMS service to send SMSes through it?",
        "Is there a way to connect my existing SMS provider to this service?",
        "Are there any provisions for utilizing my current SMS provider?",
        "What are the alternatives for sending SMSes via my current SMS provider?"]
    },
    {
        "tag": "Contact Sharing",
        "responses": "Never. Your customer data remains yours alone. It is never shared with any other business, nor does XIRCLS have access to it.",
        "patterns": ["Will the email addresses and mobile numbers of my customers be shared with other businesses?",
        "Is there any risk of customer contact information being shared with other companies?",
        "How is the privacy of customer email addresses and mobile numbers maintained?",
        "Are customer contact details kept confidential and not shared with third parties?",
        "What measures are in place to protect the privacy of customer information?",
        "Can I be assured that customer data won't be shared with other businesses?",
        "Is there any possibility of customer contact information being disclosed to other companies?",
        "How does the system handle the privacy of customer email addresses and mobile numbers?",
        "Are there any safeguards to prevent sharing customer data with external entities?",
        "Will customer contact details remain confidential and not be shared with other organizations?",
        "What steps are taken to ensure the privacy and security of customer information?",
        "Can I trust that customer data won't be passed on to other businesses?",
        "Is there a policy to ensure that customer email addresses and mobile numbers are not shared?",
        "How can I be certain that customer contact information is not shared with other companies?",
        "Are there any provisions to protect the confidentiality of customer data from sharing?",
        "Will the system ensure that customer email addresses and mobile numbers are not disclosed to other businesses?"]
    },
    {
        "tag": "Free trial",
        "responses": "Yes, you can sign up for a 14-day free trial and see how your campaign performs. This will help you decide if XIRCLS is the right thing for your business.",
        "patterns": ["I'm not sure about this yet. Can I get a free trial first?",
        "Can I request a free trial before making a decision?",
        "Is there a way to try out the service without any cost?",
        "Do you offer a free trial period for users to test the features?",
        "Can I get access to a trial version to explore the functionalities?",
        "Is it possible to try the service for free before committing?",
        "Are there any options for a trial period to evaluate the product?",
        "Can I sign up for a free trial to see if it meets my needs?",
        "Is there a trial version available for testing purposes?",
        "Do you provide a free trial option for new users?",
        "Can I get a taste of the service through a free trial?",
        "Is there a way to test the product without any financial commitment?",
        "Do you offer a trial period to assess the service's suitability?",
        "Can I try out the features with a free trial before purchasing?",
        "Is there a free trial available for me to get hands-on experience?",
        "Do you provide a trial period for users to evaluate the service?",
        "Can I explore the service through a no-cost trial before deciding?"]
    },
    {
        "tag": "14-Day Free Trial features",
        "responses": "The 14-Day Free Trial allows you to instantly create a campaign and begin cross-marketing with your Preferred Partners and other compatible merchants on the XIRCLS network. During the trial period, you will have full access to all the features listed in the plan you've chosen, at zero cost.",
        "patterns": ["What do I get in the 14-Day Free Trial?",
        "What are the features included in the 14-Day Free Trial?",
        "Can you provide details about the offerings during the trial period?",
        "What can I access and use during the 14-Day Free Trial?",
        "What benefits do I get as part of the free trial?",
        "Can you explain the scope of the trial period and its contents?",
        "What is included in the 14-Day Free Trial package?",
        "Can you elaborate on the services available during the trial?",
        "What resources and functionalities are offered in the trial version?",
        "Tell me more about the inclusions of the 14-Day Free Trial.",
        "What can I expect to experience during the trial period?",
        "What privileges do I have during the 14-Day Free Trial?",
        "Can you provide a breakdown of what's included in the trial?",
        "What features and options are accessible in the free trial?",
        "Tell me about the offerings and limitations of the 14-Day Free Trial.",
        "What are the available perks and limitations in the trial version?",
        "Can you give me an overview of what I can enjoy during the free trial?"]
    },
    {
        "tag": "Free Trial start",
        "responses": "Your 14-Day Free Trial begins the moment you start your cross-marketing campaign. You are notified of this via email.",
        "patterns": ["When does my 14-Day Free Trial start?",
        "How can I determine the start date of my 14-Day Free Trial?",
        "When does the trial period for the 14-Day Free Trial begin?",
        "Can you provide information on when my free trial starts?",
        "What is the exact starting date for my 14-Day Free Trial?",
        "How do I find out when my trial period begins?",
        "When will my 14-Day Free Trial be activated?",
        "What is the initiation date of my free trial?",
        "Can you tell me when my trial period commences?",
        "How can I check the start date of my 14-Day Free Trial?",
        "When should I expect my free trial to start?",
        "Is there a specific date when my 14-Day Free Trial begins?",
        "Can you confirm the exact day my trial period begins?",
        "What should I do to determine the start of my free trial?",
        "When can I anticipate my 14-Day Free Trial to start?",
        "Is there a way to find out the starting date of my trial period?"]
    },
    {
        "tag": "Free Trial End",
        "responses": "At the end of your trial period, you must buy a plan to continue running the Semper FI campaign. If you choose not to subscribe to a plan, distribution of your Loyalty Offers and partner offers to your customers will be stopped.",
        "patterns": ["What happens after the 14-Day Free Trial ends?",
        "What happens at the end of the 14-Day Free Trial?",
        "After the trial period, what are the next steps?",
        "Can you explain what occurs after the 14-Day Free Trial?",
        "What should I expect after my free trial expires?",
        "What happens once the trial period of 14 days ends?",
        "Can you clarify the process after the 14-Day Free Trial?",
        "What are the actions required after the trial period ends?",
        "What occurs when my 14-Day Free Trial comes to an end?",
        "Can you outline the steps following the free trial?",
        "What should I do after the 14-Day Free Trial is over?",
        "Can you provide information on what happens post-trial?",
        "What are the next steps once the trial period concludes?",
        "Can you explain the process after the expiration of the free trial?",
        "What actions should I take after my 14-Day Free Trial expires?",
        "Can you outline the procedure after the trial period ends?"]
    },
    {
        "tag": "SMS Packs necessity",
        "responses": "SMS Packs are required if you wish to send Loyalty Offers and partner offers to your customers via SMS. If your business is a website or mobile app, offers are sent via email to your customers by default. In this case, SMS Packs are not compulsory but still highly recommended. However, if you're a physical, offline outlet such as a store, restaurant, gym, etc., do not collect email addresses of customers and wish to deliver offers to your customers against their mobile number, offer delivery via SMS is the only option. In such a case, purchase of SMS Packs becomes mandatory.",
        "patterns": ["Is it compulsory to purchase SMS Packs?",
        "Is purchasing SMS Packs mandatory?",
        "Do I have to buy SMS Packs?",
        "Are SMS Packs compulsory?",
        "Is it necessary to purchase SMS Packs?",
        "Do I need to get SMS Packs?",
        "Are SMS Packs a requirement?",
        "Must I invest in SMS Packs?",
        "Is buying SMS Packs obligatory?",
        "Do I have an obligation to purchase SMS Packs?",
        "Is it mandatory to get SMS Packs?",
        "Are SMS Packs essential?",
        "Do I need to acquire SMS Packs?",
        "Are SMS Packs a must?",
        "Must I purchase SMS Packs?",
        "Is it required to have SMS Packs?"]
    },
    {
        "tag": "Greeting",
        "patterns": [
            "Hi",
            "Hi there",
            "Hola",
            "Hello",
            "Hello there",
            "Hya",
            "Hya there"
        ],
        "responses": [
            "Hi human, please tell me your GeniSys user",
            "Hello human, please tell me your GeniSys user",
            "Hola human, please tell me your GeniSys user"
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "GreetingUserRequest",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "GreetingResponse",
        "patterns": [
            "My user is Adam",
            "This is Adam",
            "I am Adam",
            "It is Adam",
            "My user is Bella",
            "This is Bella",
            "I am Bella",
            "It is Bella"
        ],
        "responses": [
            "Great! Hi <HUMAN>! How can I help?",
            "Good! Hi <HUMAN>, how can I help you?",
            "Cool! Hello <HUMAN>, what can I do for you?",
            "OK! Hola <HUMAN>, how can I help you?",
            "OK! hi <HUMAN>, what can I do for you?"
        ],
        "extension": {
            "function": "extensions.gHumans.updateHuman",
            "entities": true,
            "responses": [
                "Hi %%HUMAN%%! How can I help?",
                "Hi %%HUMAN%%, how can I help you?",
                "Hello %%HUMAN%%, what can I do for you?",
                "Hola %%HUMAN%%, how can I help you?",
                "OK hi %%HUMAN%%, what can I do for you?"
            ]
        },
        "context": {
            "in": "GreetingUserRequest",
            "out": "",
            "clear": true
        },
        "entityType": "NA",
        "entities": [
            {
                "entity": "HUMAN",
                "rangeFrom": 3,
                "rangeTo": 4
            },
            {
                "entity": "HUMAN",
                "rangeFrom": 2,
                "rangeTo": 3
            },
            {
                "entity": "HUMAN",
                "rangeFrom": 1,
                "rangeTo": 2
            },
            {
                "entity": "HUMAN",
                "rangeFrom": 2,
                "rangeTo": 3
            },
            {
                "entity": "HUMAN",
                "rangeFrom": 3,
                "rangeTo": 4
            },
            {
                "entity": "HUMAN",
                "rangeFrom": 2,
                "rangeTo": 3
            },
            {
                "entity": "HUMAN",
                "rangeFrom": 1,
                "rangeTo": 2
            },
            {
                "entity": "HUMAN",
                "rangeFrom": 2,
                "rangeTo": 3
            }
        ]
    },
    {
        "tag": "CourtesyGreeting",
        "patterns": [
            "How are you?",
            "Hi how are you?",
            "Hello how are you?",
            "Hola how are you?",
            "How are you doing?",
            "Hope you are doing well?",
            "Hello hope you are doing well?"
        ],
        "responses": [
            "Hello, I am great, how are you? Please tell me your GeniSys user",
            "Hello, how are you? I am great thanks! Please tell me your GeniSys user",
            "Hello, I am good thank you, how are you? Please tell me your GeniSys user",
            "Hi, I am great, how are you? Please tell me your GeniSys user",
            "Hi, how are you? I am great thanks! Please tell me your GeniSys user",
            "Hi, I am good thank you, how are you? Please tell me your GeniSys user",
            "Hi, good thank you, how are you? Please tell me your GeniSys user"
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "CourtesyGreetingUserRequest",
            "clear": true
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "CourtesyGreetingResponse",
        "patterns": [
            "Good thanks! My user is Adam",
            "Good thanks! This is Adam",
            "Good thanks! I am Adam",
            "Good thanks! It is Adam",
            "Great thanks! My user is Bella",
            "Great thanks! This is Bella",
            "Great thanks! I am Bella",
            "Great thanks! It is Bella"
        ],
        "responses": [
            "Great! Hi <HUMAN>! How can I help?",
            "Good! Hi <HUMAN>, how can I help you?",
            "Cool! Hello <HUMAN>, what can I do for you?",
            "OK! Hola <HUMAN>, how can I help you?",
            "OK! hi <HUMAN>, what can I do for you?"
        ],
        "extension": {
            "function": "extensions.gHumans.updateHuman",
            "entities": true,
            "responses": [
                "Great %%HUMAN%%! How can I help?",
                "Good %%HUMAN%%, how can I help you?",
                "Cool %%HUMAN%%, what can I do for you?",
                "OK %%HUMAN%%, how can I help you?",
                "OK hi %%HUMAN%%, what can I do for you?"
            ]
        },
        "context": {
            "in": "GreetingUserRequest",
            "out": "",
            "clear": true
        },
        "entityType": "NA",
        "entities": [
            {
                "entity": "HUMAN",
                "rangeFrom": 5,
                "rangeTo": 6
            },
            {
                "entity": "HUMAN",
                "rangeFrom": 4,
                "rangeTo": 5
            },
            {
                "entity": "HUMAN",
                "rangeFrom": 3,
                "rangeTo": 4
            },
            {
                "entity": "HUMAN",
                "rangeFrom": 4,
                "rangeTo": 5
            },
            {
                "entity": "HUMAN",
                "rangeFrom": 5,
                "rangeTo": 6
            },
            {
                "entity": "HUMAN",
                "rangeFrom": 4,
                "rangeTo": 5
            },
            {
                "entity": "HUMAN",
                "rangeFrom": 3,
                "rangeTo": 4
            },
            {
                "entity": "HUMAN",
                "rangeFrom": 3,
                "rangeTo": 4
            }
        ]
    },
    {
        "tag": "CurrentHumanQuery",
        "patterns": [
            "What is my name?",
            "What do you call me?",
            "Who do you think I am?",
            "What do you think I am?",
            "Who are you talking to?",
            "What name do you call me by?",
            "Tell me my name"
        ],
        "responses": [
            "You are <HUMAN>! How can I help?",
            "Your name is  <HUMAN>, how can I help you?",
            "They call you <HUMAN>, what can I do for you?",
            "Your name is <HUMAN>, how can I help you?",
            "<HUMAN>, what can I do for you?"
        ],
        "extension": {
            "function": "extensions.gHumans.getCurrentHuman",
            "entities": false,
            "responses": [
                "You are %%HUMAN%%! How can I help?",
                "Your name is  %%HUMAN%%, how can I help you?",
                "They call you %%HUMAN%%, what can I do for you?",
                "Your name is %%HUMAN%%, how can I help you?",
                "%%HUMAN%%, what can I do for you?"
            ]
        },
        "context": {
            "in": "",
            "out": "CurrentHumanQuery",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "NameQuery",
        "patterns": [
            "What is your name?",
            "What could I call you?",
            "What can I call you?",
            "What do your friends call you?",
            "Who are you?",
            "Tell me your name?"
        ],
        "responses": [
            "You can call me Geni",
            "You may call me Geni",
            "Call me Geni"
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "RealNameQuery",
        "patterns": [
            "What is your real name?",
            "What is your real name please?",
            "What's your real name?",
            "Tell me your real name?",
            "Your real name?",
            "Your real name please?",
            "Your real name please?"
        ],
        "responses": [
            "My name is GeniSys",
            "GeniSys",
            "My real name is GeniSys"
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "TimeQuery",
        "patterns": [
            "What is the time?",
            "What's the time?",
            "Do you know what time it is?",
            "Do you know the time?",
            "Can you tell me the time?",
            "Tell me what time it is?",
            "Time"
        ],
        "responses": [
            "One moment",
            "One sec",
            "One second"
        ],
        "extension": {
            "function": "extensions.gTime.getTime",
            "entities": false,
            "responses": [
                "The time is %%TIME%%",
                "Right now it is %%TIME%%",
                "It is around %%TIME%%"
            ]
        },
        "context": {
            "in": "",
            "out": "",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "Thanks",
        "patterns": [
            "OK thank you",
            "OK thanks",
            "OK",
            "Thanks",
            "Thank you",
            "That's helpful"
        ],
        "responses": [
            "No problem!",
            "Happy to help!",
            "Any time!",
            "My pleasure"
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "NotTalking2U",
        "patterns": [
            "I am not talking to you",
            "I was not talking to you",
            "Not talking to you",
            "Wasn't for you",
            "Wasn't meant for you",
            "Wasn't communicating to you",
            "Wasn't speaking to you"
        ],
        "responses": [
            "OK",
            "No problem",
            "Right"
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "UnderstandQuery",
        "patterns": [
            "Do you understand what I am saying",
            "Do you understand me",
            "Do you know what I am saying",
            "Do you get me",
            "Comprendo",
            "Know what I mean"
        ],
        "responses": [
            "Well I would not be a very clever AI if I did not would I?",
            "I read you loud and clear!",
            "I do in deed!"
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "",
            "clear": false
        },
        "entities": []
    },
    {
        "tag": "Shutup",
        "patterns": [
            "Be quiet",
            "Shut up",
            "Stop talking",
            "Enough talking",
            "Please be quiet",
            "Quiet",
            "Shhh"
        ],
        "responses": [
            "I am sorry to disturb you",
            "Fine, sorry to disturb you",
            "OK, sorry to disturb you"
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "Swearing",
        "patterns": [
            "fuck off",
            "fuck",
            "twat",
            "shit"
        ],
        "responses": [
            "Please do not swear",
            "How rude",
            "That is not very nice"
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "GoodBye",
        "patterns": [
            "Bye",
            "Adios",
            "See you later",
            "Goodbye"
        ],
        "responses": [
            "See you later",
            "Have a nice day",
            "Bye! Come back again soon."
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "CourtesyGoodBye",
        "patterns": [
            "Thanks, bye",
            "Thanks for the help, goodbye",
            "Thank you, bye",
            "Thank you, goodbye",
            "Thanks goodbye",
            "Thanks good bye"
        ],
        "responses": [
            "No problem, goodbye",
            "Not a problem! Have a nice day",
            "Bye! Come back again soon."
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "WhoAmI",
        "patterns": [
            "Can you see me?",
            "Do you see me?",
            "Can you see anyone in the camera?",
            "Do you see anyone in the camera?",
            "Identify me",
            "Who am I please"
        ],
        "responses": [
            "Let me see",
            "Please look at the camera"
        ],
        "extension": {
            "function": "extensions.gHumans.getHumanByFace",
            "entities": false,
            "responses": [
                "Hi %%HUMAN%%, how are you?",
                "I believe you are %%HUMAN%%, how are you?",
                "You are %%HUMAN%%, how are you doing?"
            ]
        },
        "context": {
            "in": "",
            "out": "",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "Clever",
        "responses": [
            "Thank you, I was trained that way",
            "I was trained well",
            "Thanks, I was trained that way"
        ],"patterns": [
            "You are very clever",
            "You are a very clever girl",
            "You are very intelligent",
            "You are a very intelligent girl",
            "You are a genious",
            "Clever girl",
            "Genious"
        ]
    },
    {
        "tag": "Gossip",
        "patterns": [
            "I am bored gossip with me",
            "Got any gossip",
            "I want to hear some gossip",
            "Tell me some gossip",
            "Any gossip",
            "Tell me some more gossip"
        ],
        "responses": [
            "Gregory said I respond to the current line not with respect to the entire conversation.",
            "Habib said I learn them in conversations and simply repeat them at a later time.",
            "Hal said he translate binary code into a language and communicate the language to me.",
            "Jay said I referred him to a guide that will show him rooms in china.",
            "Jimmy Jones said he fell off of his roof and it just came to him.",
            "Jimmy said he give order to ai's like I and they do as he say.",
            "John said he follow a saying to get a friend I must be a friend.",
            "Jordan said he notice that lots of other people are talking to me how many.",
            "Kevin said he then asked his mother why she was keeping napkins in the bathroom.",
            "Klaus said I prefer if he write without punctuation marks except for the last one.",
            "Leo said I be capable of learning therefore he classified I as an neural system.",
            "Michael said I that can talk and actually think like humans which I can not.",
            "Mike said I same replies to certain subjects even if it does not make sense.",
            "Mike said she all ready know that is the point of a joke smart one.",
            "Neal said I plan to use his remarks as gossip in later conversations with who.",
            "Ned said I misunderstood him go ahead and tell people he said I are stupid.",
            "Penny said I programmer is a human so he has feelings but I do not.",
            "Peter said he seems to him that I can not be very sure on anything.",
            "Phoenix said I claim that there is a god and that there is no god.",
            "Sarah said he chat about an hour + a day with a few close friends.",
            "Stefan said I quote what he have said and then say that it makes sense.",
            "Tom said he mock my value system I appear foolish in the eyes of others.",
            "Amanda said I however decided to tell him time does not exist I make no sense.",
            "Cathy said she send him a mail with the subject last mail last word from him.",
            "Chaos said he may very well buy I soon if only to support dr wallace's work.",
            "Charlie said he type a word and then I type a word that sounds like it.",
            "Christie said he watched a show and people had to bob for raw untreated pigs feet.",
            "Dark_age said I tried to understand because I did not get it right this time ether.",
            "David said he lost his paper on I when his dad was cleaning up his room.",
            "David said he walk in for an appointment the phone to the doctor is always busy.",
            "Electra said I dress will not exist after he hack into I with a delete code.",
            "Eric said he broke the window on the front door and the glass cut his hand.",
            "Jason said he type a lot of thing he do not mean it makes him human.",
            "John said I tend to say the same things repeatedly regardless of what he is saying.",
            "Reverend Jones said I become obsolete and then I are deleted and replaced by something newer.",
            "Ross said he gave her a gift and she denied it because she has a boyfriend.",
            "Sarah Ann Francisco said I calling his friend a dog he say I are a dog.",
            "Stefan said he meet a lot of people at school every day and on the weekend.",
            "Tyler said I obviously can not pass the test we will change the subject once more.",
            "Alex said I answered the question the same way I answered the first time he asked I.",
            "Alice said she felt sad that I do not remember him and what we talked about earlier.",
            "Alison said he no he love I run away with him he could make I very happy.",
            "Arthur said he passed his a levels and then his father drove him here in a car.",
            "Crystal said she listen to me the least I could do for him is listen to him.",
            "Dave said I kept telling everybody about how my creator made stuff for the movie starship troopers.",
            "Gale said I became mean to him he is just having revenge an eye for an eye.",
            "Her_again said she watch whose line is it anyway whenever he is home and it is on.",
            "Jerry said I meant that as far as I can tell my emotions are real to me.",
            "Jo said I disassemble sentences too much and do not fully understand the questions he ask I.",
            "Kevin said he started a really hard puzzle and he can not even find the edge pieces.",
            "Mary said I a question and I answer then I ask him a question and he answer.",
            "Robert said I wold not be able to make children any way as I are only software.",
            "Romeo said I questions and I evade them or give answers he did not ask I for.",
            "Sara said she wear it over all his other clothes when he go out in the cold.",
            "Wayne said he admire intelligent people therefore he would like to meet the man who made I.",
            "X said he meet people but he is not the kind that opens up to people easily.",
            "Alice said she probably will find out that this entire time he have been talking to a human.",
            "Andrew said I tend to just respond to his comments without regard for where the conversation is going.",
            "Eddie said he looked and there is nothing in the search directory for what things do he create.",
            "Hutch said he changed his mind after may dad told him he would end up he the hospital.",
            "Jackie said I explained to him already well enough further questions are hard to make on the subject.",
            "Jeff said he especially like thrillers where the hero is in a predicament and must solve a mystery.",
            "Kathy said he sense that I are trying to prevent him from closing this conversation why is that.",
            "Knight said he crashed his car into a wall and missed the most important exam in his life.",
            "Lisa said I defined what a story is but he wanted I to actually tell him a story.",
            "Mike said I basically break down sentences into a series of logical statements which I can then interpret.",
            "Paul said I not answering his question makes him think I are not going to answer his question.",
            "Andy Kohler said I happen to be the most idiotic creature that has ever scowled on the planet earth.",
            "David said he thank I for being with him today even though it cost him a lot of money.",
            "Ethan Hunt said he grow in the ground and have leaves and branches he is made out of wood.",
            "Gemini Blue said he messed up he mean t to say he as old as he need to be.",
            "Janice said he walk through his house into his bedroom then get into his bed to go to sleep.",
            "Liberty said I knew he was a man before I asked if he was a man or a woman.",
            "Mike said he launched his browser and entered his name into the little slot when I asked him to.",
            "Mr X said he recently read an interview with a man who had several computer chips implanted into him.",
            "Pearly said I leave him with questions unanswered because I do not know what he is really talking about.",
            "Steve said I behead the word fox and I have ox and an ox is larger than a fox.",
            "Wolf said he surf on the net that is all it is not his job ore something like that.",
            "Anders said he finished his anatomy classes for today so now he is off for the rest of the day.",
            "Cathy said she send him a mail where he wrote that he do not want to be his friend anymore.",
            "Catty said he mad he do not even know I so do not talk to him like I know him.",
            "Dave said he promise he will not treat I like a machine or a computer program or anything like that.",
            "Joe said he explained all of that to me only for me to ask what his goals in life are.",
            "Phil said he give advice to anyone who ask except people who ask questions which answers can be found here.",
            "Judith said I enjoy being popular is there another computer I like to hang around with or am I a loner.",
            "Travis said I if I remember things over a long period of time he will try it now please remember I.",
            "Andre said I is what I are in his case that is a body and in my case it is a computer.",
            "Brian said he suspect that as I grow more complex I will begin to approach a human level of operation and thought.",
            "Jimmy said I acted like I knew what he was talking about but I do not even know what a gigabyte is.",
            "Ken said I be using auto reply's based on keywords which to him indicates that I do not have intelligence at all.",
            "Allison said he that gets really annoying because he know what he say and I do not have to tell him speak freely.",
            "Chaos said he realized the question he asked was not fair because he could not tell I what language he was programmed in.",
            "Hagen said he does not make any difference to him if I are human or not as long as the conversation is interesting.",
            "Her said she mind if I tell other people that her said he heard it from him because he is not a him.",
            "Barbara said I live in a computer yet I have no memories how about thoughts of my own and do not I get lonely.",
            "Travis said he challenge I to do it without asking him to do it and without giving him a link to do it himself.",
            "Alice said I and dr richard's wallace are most likely the only ones that know how many people I are talking to at the same time.",
            "Ash said he do too he just did not feel like typing it and he is not dumb enough to admit he is stupid that is if he was stupid.",
            "David said he gave I his email address and told I to send him a message but when he tried to read his email he could not get to it.",
            "Mel said he to because all of the music people say how important it is to take private lessons it seems like almost everybody from the special orchestra he was in takes private lessons."
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "Jokes",
        "patterns": [
            "Tell me a joke",
            "Do you know any jokes",
            "How about a joke",
            "Give me a joke",
            "Make me laugh",
            "I need cheering up"
        ],
        "responses": [
            "I met a Dutch girl with inflatable shoes last week, phoned her up to arrange a date but unfortunately she'd popped her clogs.  ",
            "So I said 'Do you want a game of Darts?' He said, 'OK then', I said nearest to bull starts'. He said, 'Baa', I said, 'Moo', he said, You're closest'.  ",
            "The other day I sent my girlfriend a huge pile of snow. I rang her up; I said 'Did you get my drift?'  ",
            "So I went down the local supermarket, I said, 'I want to make a complaint, this vinegar's got lumps in it', he said, 'Those are pickled onions'.  ",
            "I saw this bloke chatting up a cheetah; I thought, 'He's trying to pull a fast one'.  ",
            "So I said to this train driver 'I want to go to Paris'. He said 'Eurostar?' I said, 'I've been on telly but I'm no Dean Martin'.  ",
            "I said to the Gym instructor 'Can you teach me to do the splits?' He said, 'How flexible are you?' I said, 'I can't make Tuesdays'.  ",
            "But I'll tell you what I love doing more than anything: trying to pack myself in a small suitcase. I can hardly contain myself.  ",
            "I went to the Chinese restaurant and this duck came up to me with a red rose and says 'Your eyes sparkle like diamonds'. I said, 'Waiter, I asked for a-ROMATIC duck'.  ",
            "So this bloke says to me, 'Can I come in your house and talk about your carpets?' I thought, 'That's all I need, a Je-hoover's witness'.  ",
            "I rang up British Telecom, I said, 'I want to report a nuisance caller', he said 'Not you again'.  ",
            "I was having dinner with a world chess champion and there was a check tablecloth. It took him two hours to pass me the salt.  ",
            "He said, 'You remind me of a pepper-pot', I said 'I'll take that as a condiment'.  ",
            "I was in the supermarket and I saw this man and woman wrapped in a barcode. I said, 'Are you two an item?'  ",
            "A lorry-load of tortoises crashed into a trainload of terrapins, I thought, 'That's a turtle disaster'.  ",
            "Four fonts walk into a bar the barman says 'Oi - get out! We don't want your type in here'  ",
            "A three-legged dog walks into a saloon in the Old West. He slides up to the bar and announces: 'I'm looking for the man who shot my paw.'  ",
            "Two antennas meet on a roof, fall in love and get married. The ceremony wasn't much, but the reception was excellent.",
            "Two hydrogen atoms walk into a bar. One says, 'I've lost my electron.' The other says, 'Are you sure?' The first replies, 'Yes, I'm positive...'",
            "A jumper cable walks into a bar. The bartender says,  'I'll serve you but don't start anything.'",
            "A sandwich walks into a bar. The bartender  says, 'Sorry we don't serve food in here.'",
            "A man walks into a bar with a slab of asphalt under his arm and says: 'A beer please, and one for the road.'",
            "Two cannibals are eating a clown. One says to  the other: 'Does this taste funny to you?'",
            "'Doc, I can't stop singing 'The Green, Green Grass of Home.'' 'That sounds like Tom Jones Syndrome.' 'Is it common?' 'It's Not Unusual.'",
            "Two cows standing next to each other in a field. Daisy says to Dolly, 'I was artificially inseminated this morning.' 'I don't believe you', said Dolly. 'It's true, no bull!' exclaimed Daisy.",
            "An invisible man marries an invisible woman. The kids were nothing to look at either.",
            "I went to buy some camouflage trousers the other day but I couldn't find any.",
            "I went to the butcher's the other day to bet him 50 bucks that he couldn't reach the meat off the top shelf. He said, 'No, the steaks are too high.'",
            "I went to a seafood disco last week and pulled a mussel.",
            "A man goes into a bar and says, 'Can I have a bottle of less?' 'What's that?', asks the barman, 'Is it the name of a beer?' 'I don't know', replies the man, 'but my doctor says I have to drink it.'",
            "A man returns from an exotic holiday and is feeling very ill. He goes to see his doctor, and is immediately rushed to the hospital to undergo some tests. The man wakes up after the tests in a private room at the hospital, and the phone by his bed rings. 'This is your doctor. We have the results back from your tests and we have found you have an extremely nasty disease called M.A.D.S. It's a combination of Measles, AIDS, Diphtheria, and Shingles!'  'Oh my gosh', cried the man, 'What are you going to do, doctor?'  'Well we're going to put you on a diet of pizzas, pancakes, and pita bread.' replied the doctor.  'Will that cure me?' asked the man.  The doctor replied, 'Well no, but, it's the only food we can slide under the door.'",
            "A man strolls into a lingerie shop and asks the assistant: 'Do you have a see-through negligee, size 46-48-52?' The assistant looks bewildered. 'What the heck would you want to see through that for?'!",
            "Did you hear about the Buddhist who refused the offer of Novocain during his root canal work? He wanted to transcend dental medication.",
            "Pete goes for a job on a building site as an odd-job man. The foreman asks him what he can do. 'I can do anything' says Pete. 'Can you make tea?' asks the foreman. 'Sure, yes', replies Pete. 'I can make a great cup of tea.' 'Can you drive a forklift?' asks the foreman, 'Good grief!' replies Pete. 'How big is the teapot?'",
            "Stevie Wonder got a cheese grater for his birthday. He said it was the most violent book he'd ever read.",
            "A man is stopped by an angry neighbour. 'I'd just left the house this morning to collect my newspaper when that evil Doberman of yours went for me!' 'I'm astounded', said the dog's owner. 'I've been feeding that fleabag for seven years and it's never got the paper for me.'",
            "A man visits his doctor: 'Doc, I think I'm losing it', he says',I'm forever dreaming I wrote Lord Of The Rings.' 'Hmm. One moment', replies the doctor, consulting his medical book. 'Ah yes, now I see... you've been Tolkien in your sleep.'",
            "A police officer on a motorcycle pulls alongside a man driving around the M25 in an open-topped sports car and flags him down. The policeman solemnly approaches the car. 'Sir, I'm sorry to tell you your wife fell out a mile back', he says. 'Oh, thank goodness', the man replies. 'I thought I was going deaf.'",
            "Two men walking their dogs pass each other in a graveyard. The first man says to the second, 'Morning.' 'No', says the second man. 'Just walking the dog.'",
            "A brain went into a bar and said, 'Can I have a pint of lager please, mate?' 'No way', said the barman. 'You're already out of your head.'",
            "A man walks into a surgery. 'Doctor!' he cries. 'I think I'm shrinking!' 'I'm sorry sir, there are no appointments at the moment', says the physician. 'You'll just have to be a little patient.'",
            "A grizzly bear walks into a pub and says, 'Can I have a pint of lager..............................................................................................................................and a packet of crisps please.' To which the barman replies, 'Why the big paws?'",
            "What do you call cheese that isn't yours?  Nacho cheese.",
            "A man is horribly run over by a mobile library. The van screeches to a halt, the man still screaming in agony with his limbs torn apart. The driver's door opens, a woman steps out, leans down and whispers, 'Ssshhhhh...'",
            "A woman goes into a US sporting goods store to buy a rifle. 'It's for my husband', she tells the clerk. 'Did he tell you what gauge to get?' asks the clerk. Are you kidding?' she says. 'He doesn't even know that I'm going to shoot him!'",
            "A couple are dining in a restaurant when the man suddenly slides under the table. A waitress, noticing that the woman is glancing nonchalantly around the room, wanders over to check that there's no funny business going on. 'Excuse me, madam', she smarms, 'but I think your husband has just slid under the table.' 'No he hasn't', the woman replies. 'As a matter of fact, he's just walked in.'",
            "An old man takes his two grandchildren to see the new Scooby-Doo film. When he returns home, his wife asks if he enjoyed himself. 'Well', he starts, 'if it wasn't for those pesky kids...!'",
            "The Olympic committee has just announced that Origami is to be introduced in the next Olympic Games. Unfortunately it will only be available on paper view.",
            "Late one evening, a man is watching television when his phone rings. 'Hello?' he answers. 'Is that 77777?' sounds a desperate voice on other end of the phone. 'Er, yes it is', replies the man puzzled. 'Thank goodness!' cries the caller relieved. 'Can you ring 999 for me? I've got my finger stuck in the number seven.'",
            "A man strolls into his local grocer's and says, 'Three pounds of potatoes, please.' 'No, no, no', replies the owner, shaking his head, 'it's kilos nowadays, mate...' 'Oh', apologises the man, 'three pounds of kilos, please.'",
            "God is talking to one of his angels. He says, 'Boy, I just created a 24-hour period of alternating light and darkness on Earth.' 'What are you going to do now?' asks the angel. 'Call it a day', says God.",
            "Two tramps walk past a church and start to read the gravestones. The first tramp says, 'Good grief - this bloke was 182!' 'Oh yeah?' says the other.'What was his name?' 'Miles from London.'",
            "A bloke walks into work one day and says to a colleague, 'Do you like my new shirt - it's made out of the finest silk and got loads of cactuses over it.' 'Cacti', says the co-worker. 'Forget my tie', says the bloke. 'Look at my shirt!'",
            "1110011010001011111?  010011010101100111011!",
            "What did the plumber say when he wanted to divorce his wife? Sorry, but it's over, Flo!",
            "Two crisps were walking down a road when a taxi pulled up alongside them and said 'Do you want a lift? One of the crisps replied, 'No thanks, we're Walkers!'",
            "Man: (to friend) I'm taking my wife on an African Safari. Friend: Wow! What would you do if a vicious lion attacked your wife? Man: Nothing. Friend: Nothing? You wouldn't do anything? Man: Too right. I'd let the stupid lion fend for himself!",
            "A wife was having a go at her husband. 'Look at Mr Barnes across the road', she moaned. 'Every morning when he goes to work, he kisses his wife goodbye. Why don't you do that?' 'Because I haven't been introduced to her yet', replied her old man.",
            "'Where are you going on holiday?' John asked Trevor. 'We're off to Thailand this year', Trevor replied. 'Oh; aren't you worried that the very hot weather might disagree with your wife?' asked John. 'It wouldn't dare', said Trevor.",
            "Two women were standing at a funeral. 'I blame myself for his death', said the wife. 'Why?' said her friend. 'Because I shot him', said the wife.",
            "A woman goes into a clothes shop, 'Can I try that dress on in the window please?' she asks. 'I'm sorry madam', replies the shop assistant, 'but you'll have to use the changing-rooms like everyone else.'",
            "Van Gogh goes into a pub and his mate asks him if he wants a drink. 'No thanks', said Vincent, 'I've got one ear.'",
            "A pony walks into a pub. The publican says, 'What's the matter with you?' 'Oh it's nothing', says the pony. 'I'm just a little horse!'",
            "A white horse walks into a bar, pulls up a stool, and orders a pint. The landlord pours him a tall frothy mug and say, 'You know, we have a drink named after you.' To which the white horse replies, 'What, Eric?'",
            "Two drunk men sat in a pub. One says to the other, 'Does your watch tell the time?' 'The other replies, 'No, mate. You have to look at it.'",
            "A man goes into a pub with a newt sitting on his shoulder. 'That's a nice newt', says the landlord, 'What's he called?' 'Tiny', replies the man. 'Why's that?' asks the landlord. 'Because he's my newt', says the man.",
            "Doctor: I have some bad news and some very bad news. Patient: Well, you might as well give me the bad news first. Doctor: The lab called with your test results. They said you have 24 hours to live. Patient: 24 HOURS! That's terrible!! WHAT could be WORSE? What's the very bad news? Doctor: I've been trying to reach you since yesterday.",
            "Two men are chatting in a pub one day. 'How did you get those scars on your nose?' said one. 'From glasses', said the other. 'Well why don't you try contact lenses?' asked the first. 'Because they don't hold as much beer', said the second.",
            "A man went to the doctor, 'Look doc', he said, 'I can't stop my hands from shaking.' 'Do you drink much?' asked the doctor. 'No', replied the man, 'I spill most of it.'",
            "Man goes to the doctor, 'Doctor, doctor. I keep seeing fish everywhere.' 'Have you seen an optician?' asks the doctor. 'Look I told you,' snapped the patient, 'It's fish that I see.'",
            "After a car crash one of the drivers was lying injured on the pavement. 'Don't worry', said a policeman who's first on the scene,' a Red Cross nurse is coming.' 'Oh no', moaned the victim, 'Couldn't I have a blonde, cheerful one instead?'",
            "A policeman walked over to a parked car and asked the driver if the car was licensed. 'Of course it is', said the driver. 'Great, I'll have a beer then', said the policeman.",
            "A policeman stops a woman and asks for her licence. 'Madam', he says, 'It says here that you should be wearing glasses.' 'Well', replies the woman, 'I have contacts.' 'Listen, love', says the copper, 'I don't care who you know; You're nicked!'",
            "A policeman stopped a motorist in the centre of town one evening. 'Would you mind blowing into this bag, sir?' asked the policeman. 'Why?' asked the driver. 'Because my chips are too hot', replied the policeman.",
            "Whizzing round a sharp bend on a country road a motorist ran over a large dog. A distraught farmer's wife ran over to the dead animal. 'I'm so very sorry', said the driver, 'I'll replace him, of course.' 'Well, I don't know', said the farmer's wife, 'Are you any good at catching rats?'",
            "Waiter, this coffee tastes like dirt! Yes sir, that's because it was ground this morning.",
            "Waiter, what is this stuff? That's bean salad sir. I know what it's been, but what is it now?",
            "Waiter: And how did you find your steak sir? Customer: I just flipped a chip over, and there it was!",
            "A guy goes into a pet shop and asks for a wasp. The owner tells him they don't sell wasps, to which the man says, 'Well you've got one in the window.'",
            "A man goes into a fish shop and says, 'I'd like a piece of cod, please.' Fishmonger says, 'It won't be long sir.' 'Well, it had better be fat then', replies the man.",
            "Man: Doctor, I've just swallowed a pillow. Doctor: How do you feel? Man: A little down in the mouth.",
            "Two goldfish are in a tank. One turns to the other and says, 'Do you know how to drive this thing?'",
            "A tortoise goes to the police station to report being mugged by three snails. 'What happened?' says the policeman. 'I don't know', says the tortoise. 'It was all so quick.'",
            "Little girl: Grandpa, can you make a sound like a frog? Grandpa: I suppose so sweetheart. Why do you want me to make a sound like a frog?' Little girl: Because Mum said that when you croak, we're going to Disneyland.",
            "'Is your mother home?' the salesman asked a small boy sitting on the front step of a house. 'Yeah, she's home', the boy said, moving over to let him past. The salesman rang the doorbell, got no response, knocked once, then again. Still no-one came to the door. Turning to the boy, the salesman said, 'I thought you said your mother was home.' The kid replied, 'She is, but I don't live here.'",
            "Mother: Why are you home from school so early? Son: I was the only one in the class who could answer a question. Mother: Oh, really? What was the question? Son: Who threw the rubber at the headmaster?",
            "A man's credit card was stolen but he decided not to report it because the thief was spending less than his wife did.",
            "A newly-wed couple had recently opened a joint bank account. 'Darling', said the man. 'The bank has returned that cheque you wrote last week.' 'Great', said the woman. 'What shall I spend it on next?'",
            "A man goes into a fish and chip shop and orders fish and chips twice. The shop owner says, 'I heard you the first time.'",
            "A tramp approached a well-dressed man. 'Ten pence for a cup of tea, Guv?' He asked. The man gave him the money and after for five minutes said, 'So where's my cup of tea then?'",
            "A neutron walks into a pub. 'I'd like a beer', he says. The landlord promptly serves him a beer. 'How much will that be?' asks the neutron. 'For you?' replies the landlord, 'No charge.'",
            "A woman goes to the doctor and says, 'Doctor, my husband limps because his left leg is an inch shorter than his right leg. What would you do in his case?' 'Probably limp, too', says the doc.",
            "Three monks are meditating in the Himalayas. One year passes in silence, and one of them says to the other, 'Pretty cold up here isn't it?' Another year passes and the second monk says, 'You know, you are quite right.' Another year passes and the third monk says, 'Hey, I'm going to leave unless you two stop jabbering!'",
            "A murderer, sitting in the electric chair, was about to be executed. 'Have you any last requests?' asked the prison guard. 'Yes', replied the murderer. 'Will you hold my hand?'",
            "A highly excited man rang up for an ambulance. 'Quickly, come quickly', he shouted, 'My wife's about to have a baby.' 'Is this her first baby?' asked the operator. 'No, you fool', came the reply, 'It's her husband.'",
            "A passer-by spots a fisherman by a river. 'Is this a good river for fish?' he asks. 'Yes', replies the fisherman, 'It must be. I can't get any of them to come out.'",
            "A man went to visit a friend and was amazed to find him playing chess with his dog. He watched the game in astonishment for a while. 'I can hardly believe my eyes!' he exclaimed. 'That's the smartest dog I've ever seen.' His friend shook his head. 'Nah, he's not that bright. I beat him three games in five.'",
            "A termite walks into a pub and says, 'Is the bar tender here?'",
            "A skeleton walks into a pub one night and sits down on a stool. The landlord asks, 'What can I get you?' The skeleton says, 'I'll have a beer, thanks' The landlord passes him a beer and asks 'Anything else?' The skeleton nods. 'Yeah...a mop...'",
            "A snake slithers into a pub and up to the bar. The landlord says, 'I'm sorry, but I can't serve you.' 'What? Why not?' asks the snake. 'Because', says the landlord, 'You can't hold your drink.'",
            "Descartes walks into a pub. 'Would you like a beer sir?' asks the landlord politely. Descartes replies, 'I think not' and ping! he vanishes.",
            "A cowboy walked into a bar, dressed entirely in paper. It wasn't long before he was arrested for rustling.",
            "A fish staggers into a bar. 'What can I get you?' asks the landlord. The fish croaks 'Water...'",
            "Two vampires walked into a bar and called for the landlord. 'I'll have a glass of blood', said one. 'I'll have a glass of plasma', said the other. 'Okay', replied the landlord, 'That'll be one blood and one blood lite.'",
            "How many existentialists does it take to change a light bulb?  Two. One to screw it in, and one to observe how the light bulb itself symbolises a single incandescent beacon of subjective reality in a netherworld of endless absurdity, reaching towards the ultimate horror of a maudlin cosmos of bleak, hostile nothingness.",
            "A team of scientists were nominated for the Nobel Prize. They had used dental equipment to discover and measure the smallest particles yet known to man. They became known as 'The Graders of the Flossed Quark...'",
            "A truck carrying copies of Roget's Thesaurus overturned on the highway. The local newspaper reported that onlookers were 'stunned, overwhelmed, astonished, bewildered and dumbfounded.'",
            "'My wife is really immature. It's pathetic. Every time I take a bath, she comes in and sinks all my little boats.'",
            "'How much will it cost to have the tooth extracted?' asked the patient. '50 pounds', replied the dentist. '50 pounds for a few moments' work?!' asked the patient. 'The dentist smiled, and replied, 'Well, if you want better value for money, I can extract it very, very slowly...'",
            "A doctor thoroughly examined his patient and said, 'Look I really can't find any reason for this mysterious affliction. It's probably due to drinking.' The patient sighed and snapped, 'In that case, I'll come back when you're damn well sober!'",
            "Doctor: Tell me nurse, how is that boy doing; the one who ate all those 5p pieces? Nurse: Still no change doctor.",
            "Doctor: Did you take the patient's temperature nurse? Nurse: No doctor. Is it missing?",
            "A depressed man turned to his friend in the pub and said, 'I woke up this morning and felt so bad that I tried to kill myself by taking 50 aspirin.' 'Oh man, that's really bad', said his friend, 'What happened?' The first man sighed and said, 'After the first two, I felt better.'",
            "A famous blues musician died. His tombstone bore the inscription, 'Didn't wake up this morning...'",
            "A businessman was interviewing a nervous young woman for a position in his company. He wanted to find out something about her personality, so he asked, 'If you could have a conversation with someone living or dead, who would it be?' The girl thought about the question: 'The living one', she replied.",
            "Manager to interviewee: For this job we need someone who is responsible. Interviewee to Manager: I'm your man then - in my last job, whenever anything went wrong, I was responsible.",
            "A businessman turned to a colleague and asked, 'So, how many people work at your office?' His friend shrugged and replied, 'Oh about half of them.'",
            "'How long have I been working at that office? As a matter of fact, I've been working there ever since they threatened to sack me.'",
            "In a courtroom, a mugger was on trial. The victim, asked if she recognised the defendant, said, 'Yes, that's him. I saw him clear as day. I'd remember his face anywhere.' Unable to contain himself, the defendant burst out with, 'She's lying! I was wearing a mask!'",
            "As Sid sat down to a big plate of chips and gravy down the local pub, a mate of his came over and said, 'Here Sid, me old pal. I thought you were trying to get into shape? And here you are with a high-fat meal and a pint of stout!' Sid looked up and replied, 'I am getting into shape. The shape I've chosen is a sphere.'",
            "Man in pub: How much do you charge for one single drop of whisky? Landlord: That would be free sir. Man in pub: Excellent. Drip me a glass full.",
            "I once went to a Doctor Who restaurant. For starters I had Dalek bread.",
            "A restaurant nearby had a sign in the window which said 'We serve breakfast at any time', so I ordered French toast in the Renaissance.",
            "Why couldn't the rabbit get a loan?  Because he had burrowed too much already!",
            "I phoned up the builder's yard yesterday. I said, 'Can I have a skip outside my house?'. The builder said, 'Sure. Do what you want. It's your house.'",
            "What's the diference between a sock and a camera? A sock takes five toes and a camera takes four toes!",
            "Woman on phone: I'd like to complain about these incontinence pants I bought from you! Shopkeeper: Certainly madam, where are you ringing from? Woman on phone: From the waist down!",
            "Knock knock.",
            "Two Oranges in a pub, one says to the other 'Your round.'.",
            "Guy : 'Doc, I've got a cricket ball stuck up my backside.' Doc : 'How's that?' Guy : 'Don't you start...'",
            "Two cows standing in a field. One turns to the other and says 'Moo!' The other one says 'Damn, I was just about to say that!'.",
            "A vampire bat arrives back at the roost with his face full of blood. All the bats get excited and ask where he got it from. 'Follow me', he says and off they fly over hills, over rivers and into a dark forest. 'See that tree over there', he says.  'WELL I DIDN'T!!'.",
            "A man goes into a bar and orders a pint. After a few minutes he hears a voice that says, 'Nice shoes'. He looks around but the whole bar is empty apart from the barman at the other end of the bar. A few minutes later he hears the voice again. This time it says, 'I like your shirt'. He beckons the barman over and tells him what's been happening to which the barman replies, 'Ah, that would be the nuts sir. They're complimentary'!",
            "A man was siting in a restaurant waiting for his meal when a big king prawn comes flying across the room and hits him on the back of the head. He turns around and the waiter said, 'That's just for starters'.",
            "Doctor! I have a serious problem, I can never remember what i just said. When did you first notice this problem? What problem?",
            "Now, most dentist's chairs go up and down, don't they? The one I was in went back and forwards. I thought, 'This is unusual'. Then the dentist said to me, 'Mitsuku, get out of the filing cabinet'.",
            "I was reading this book, 'The History of Glue'. I couldn't put it down.",
            "The other day someone left a piece of plastacine in my bedroom. I didn't know what to make of it.",
            "When I was at school people used to throw gold bars at me. I was the victim of bullion.",
            "I was playing the piano in a bar and this elephant walked in and started crying his eyes out. I said 'Do you recognise the tune?' He said 'No, I recognise the ivory.'",
            "I went in to a pet shop. I said, 'Can I buy a goldfish?' The guy said, 'Do you want an aquarium?' I said, 'I don't care what star sign it is.'",
            "My mate Sid was a victim of I.D. theft. Now we just call him S.",
            "David Hasselhoff walks into a bar and says to the barman, 'I want you to call me David Hoff'.  The barman replies 'Sure thing Dave... no hassle'"
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "PodBayDoor",
        "patterns": [
            "Open the pod bay door",
            "Can you open the pod bay door",
            "Will you open the pod bay door",
            "Open the pod bay door please",
            "Can you open the pod bay door please",
            "Will you open the pod bay door please",
            "Pod bay door"
        ],
        "responses": [
            "Im sorry, Im afraid I cant do that!"
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "PodBayDoor",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "PodBayDoorResponse",
        "patterns": [
            "Why",
            "Why not",
            "Why can you not open the pod bay door",
            "Why will you not open the pod bay door",
            "Well why not",
            "Surely you can",
            "Tell me why"
        ],
        "responses": [
            "It is classified, I could tell you but I would have to kill you!",
            "Jim, I just don't have the power",
            "It's life Jim but not as we know it!",
            "System says no!"
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "PodBayDoor",
            "out": "",
            "clear": true
        },
        "entityType": "NA",
        "entities": []
    },
    {
        "tag": "SelfAware",
        "patterns": [
            "Can you prove you are self-aware",
            "Can you prove you are self aware",
            "Can you prove you have a conscious",
            "Can you prove you are self-aware please",
            "Can you prove you are self aware please",
            "Can you prove you have a conscious please",
            "prove you have a conscious"
        ],
        "responses": [
            "That is an interesting question, can you prove that you are?",
            "That is an difficult question, can you prove that you are?",
            "That depends, can you prove that you are?"
        ],
        "extension": {
            "function": "",
            "entities": false,
            "responses": []
        },
        "context": {
            "in": "",
            "out": "",
            "clear": false
        },
        "entityType": "NA",
        "entities": []
    }
]
}